ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR32FxQI/DeviceSupport/MDR32FG16S1QI/inc/MDR32FG16S1QI.h

/**
  * FILE MDR32FG16S1QI.h
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32FG16S1QI_H
#define __MDR32FG16S1QI_H

/** @addtogroup __CMSIS CMSIS
  * @{
  */

/** @addtogroup MDR32FG16S1QI MDR32FG16S1QI
  * @{
  */

/** @addtogroup __MDR32FG16S1QI_Peripheral MDR32FG16S1QI Peripheral
  * @{
  */

#ifdef __cplusplus
extern "C" {
#endif

#if defined ( __CC_ARM )
    #pragma anon_unions
#endif

/**
  * @brief MDR32FG16S1QI Interrupt Number Definition
  */

typedef enum IQRn
{
/*-- Processor Exceptions Numbers ---------------------------------------------*/
    NonMaskableInt_IRQn                   = -14, /*!< 2 Non Maskable Interrupt */
    HardFault_IRQn                        = -13, /*!< 3 Hard Fault Interrupt */
    MemoryManagement_IRQn                 = -12, /*!< 4 Memory Management Interrupt */
    BusFault_IRQn                         = -11, /*!< 5 Bus Fault Interrupt */
    UsageFault_IRQn                       = -10, /*!< 6 Usage Fault Interrupt */
    SVCall_IRQn                           = -5, /*!< 10 SV Call Interrupt */
    PendSV_IRQn                           = -2, /*!< 14 Pend SV Interrupt */
    SysTick_IRQn                          = -1, /*!< 15 System Tick Timer Interrupt */

/*-- MDR32FG16S1QI specific Interrupt Numbers --------------------------------------*/
    SSP3_IRQn                             = 0, /*!< SSP3 Interrupt */
    SSP4_IRQn                             = 1, /*!< SSP4  Interrupt */
    USB_IRQn                              = 2, /*!< USB Host  Interrupt */
    MCBSP1_IRQn                           = 3, /*!< MCBSP1  Interrupt */
    MCBSP2_IRQn                           = 4, /*!< MCBSP2  Interrupt */
    DMA_IRQn                              = 5, /*!< DMA  Interrupt */
    UART1_IRQn                            = 6, /*!< UART1  Interrupt */
    UART2_IRQn                            = 7, /*!< UART2  Interrupt */
    SSP1_IRQn                             = 8, /*!< SSP1  Interrupt */
    MCBSP3_IRQn                           = 9, /*!< MCBSP3  Interrupt */
    I2C_IRQn                              = 10, /*!< I2C  Interrupt */
    POWER_IRQn                            = 11, /*!< POWER Detecor  Interrupt */
    WWDG_IRQn                             = 12, /*!< Window Watchdog  Interrupt */
    DMA_DSP_IRQn                          = 13, /*!< DMA DSP  Interrupt */
    TIMER1_IRQn                           = 14, /*!< Timer1  Interrupt */
    TIMER2_IRQn                           = 15, /*!< Timer2  Interrupt */
    TIMER3_IRQn                           = 16, /*!< Timer3  Interrupt */
    ADC_IRQn                              = 17, /*!< ADC  Interrupt */
    SDIO_IRQn                             = 18, /*!< SDIO  Interrupt */
    COMPARATOR_IRQn                       = 19, /*!< COMPARATOR  Interrupt */
    SSP2_IRQn                             = 20, /*!< SSP2  Interrupt */
    AUDIO_IP_IRQn                         = 21, /*!< Audio IP  Interrupt */
    DSP_CRPT_IRQn                         = 22, /*!< DSP CRPT  Interrupt */
    DSP_TIMER_IRQn                        = 23, /*!< DSP TIMER  Interrupt */
    DSP_CORE_IRQn                         = 24, /*!< DSP CORE  Interrupt */
    DSP_STATE_IRQn                        = 25, /*!< DSP STATE  Interrupt */
    UART3_IRQn                            = 26, /*!< UART3  Interrupt */
    BACKUP_IRQn                           = 27, /*!< BACKUP  Interrupt */
    EXT_INT1_IRQn                         = 28, /*!< EXT_INT1  Interrupt */
    EXT_INT2_IRQn                         = 29, /*!< EXT_INT2  Interrupt */
    EXT_INT3_IRQn                         = 30, /*!< EXT_INT3  Interrupt */
    EXT_INT4_IRQn                         = 31  /*!< EXT_INT4  Interrupt */
}IRQn_Type;

/** @addtogroup __MDR32FG16S1QI__Configuration_of_CMSIS Configuration of CMSIS
  * @{
  */
/* Configuration of the Processor and Core Peripherals */
#define __CM3_REV              0x0102   /*!< Core Revision                                */
#define __MPU_PRESENT             1     /*!< MPU present or not                           */
#define __NVIC_PRIO_BITS          3     /*!< Number of Bits used for Priority Levels      */
#define __Vendor_SysTickConfig    0     /*!< Set to 1 if different SysTick Config is used */

/** @} */ /* End of group __MDR32FG16S1QI__Configuration_of_CMSIS */


/* Includes ------------------------------------------------------------------*/
#include "MDR32FxQI_config.h"
#include "core_cm3.h"
#include "system_MDR32FG16S1QI.h"

/** @defgroup __MDR32FG16S1QI___Exported_types Exported types
  * @{
  */

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus, BitStatus;

#define IS_BIT_STATUS(STATUS)       (((STATUS) == RESET) || ((STATUS) == SET))

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE)  (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/** @} */ /* End of group __MDR32FG16S1QI___Exported_types */

/** @defgroup MDR32FG16S1QI_Peripheral_Units MDR32FG16S1QI Peripheral Units
  * @{
  */

/** @defgroup MDR32FG16S1QI_Periph_SSP SSP
  * @{
  */

/* MDR_SSPx_TypeDef structure */
typedef struct {
	__IO uint32_t	CR0;                    /*!<SSP Control0 Register */
	__IO uint32_t	CR1;                    /*!<SSP Control1 Register */
	__IO uint32_t	DR;                     /*!<SSP Data Register */
	__IO uint32_t	SR;                     /*!<SSP Status Register */
	__IO uint32_t	CPSR;                   /*!<SSP Clock Prescaler Register */
	__IO uint32_t	IMSC;                   /*!<SSP Interrupt Mask Register */
	__IO uint32_t	RIS;                    /*!<SSP Interrupt Pending Register */
	__IO uint32_t	MIS;                    /*!<SSP Masked Interrupt Pending Register */
	__IO uint32_t	ICR;                    /*!<SSP Interrupt Clear Register */
	__IO uint32_t	DMACR;                  /*!<SSP DMA Control Register */
}MDR_SSP_TypeDef;

/** @defgroup Periph_SSP_CR0 SSP CR0
  * @{
  */

/*-- SSP_CR0:SSP CR0 Register -----*/

/* Bit field positions: */
#define SSP_CR0_DSS_Pos                                    0
#define SSP_CR0_FRF_Pos                                    4
#define SSP_CR0_SPO_Pos                                    6
#define SSP_CR0_SPH_Pos                                    7
#define SSP_CR0_SCR_Pos                                    8

/* Bit field masks: */
#define SSP_CR0_DSS_Msk                                    ((uint32_t)0x0000000F)
#define SSP_CR0_FRF_Msk                                    ((uint32_t)0x00000030)
#define SSP_CR0_SPO                                        ((uint32_t)0x00000040)
#define SSP_CR0_SPH                                        ((uint32_t)0x00000080)
#define SSP_CR0_SCR_Msk                                    ((uint32_t)0x0000FF00)

