ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR32FxQI/DeviceSupport/MDR32FG16S1QI/inc/MDR32FG16S1QI.h
/** @} */ /* End of group USB_HTXC */

/** @defgroup Periph_USB_HTXT USB HTXT
  * @{
  */

/*-- USB_HTXT:USB HTXT Register -----*/

/* Bit field positions: */
#define USB_HTXT_TTYPE_Pos                                 0

/* Bit field masks: */
#define USB_HTXT_TTYPE_Msk                                 ((uint32_t)0x00000003)

/** @} */ /* End of group USB_HTXT */

/** @defgroup Periph_USB_HTXLC USB HTXLC
  * @{
  */

/*-- USB_HTXLC:USB HTXLC Register -----*/

/* Bit field positions: */
#define USB_HTXLC_Pos                                      0
#define USB_HTXLC_DC_Pos                                   2
#define USB_HTXLC_FSPL_Pos                                 3
#define USB_HTXLC_FSLR_Pos                                 4

/* Bit field masks: */
#define USB_HTXLC_Msk                                	   ((uint32_t)0x00000003)
#define USB_HTXLC_DC                                       ((uint32_t)0x00000004)
#define USB_HTXLC_FSPL                                     ((uint32_t)0x00000008)
#define USB_HTXLC_FSLR                                     ((uint32_t)0x00000010)

/** @} */ /* End of group USB_HTXLC */

/** @defgroup Periph_USB_HTXSE USB HTXSE
  * @{
  */

/*-- USB_HTXSE:USB HTXSE Register -----*/

/* Bit field positions: */
#define USB_HTXSE_SOFEN_Pos                                0

/* Bit field masks: */
#define USB_HTXSE_SOFEN                                    ((uint32_t)0x00000001)

/** @} */ /* End of group USB_HTXSE */

/** @defgroup Periph_USB_HTXA USB HTXA
  * @{
  */

/*-- USB_HTXA:USB HTXA Register -----*/

/* Bit field positions: */
#define USB_HTXA_DEVADDR_Pos                               0

/* Bit field masks: */
#define USB_HTXA_DEVADDR_Msk                               ((uint32_t)0x0000007F)

/** @} */ /* End of group USB_HTXA */

/** @defgroup Periph_USB_HTXE USB HTXE
  * @{
  */

/*-- USB_HTXE:USB HTXE Register -----*/

/* Bit field positions: */
#define USB_HTXE_EPADDR_Pos                                0

/* Bit field masks: */
#define USB_HTXE_EPADDR_Msk                                ((uint32_t)0x0000000F)

/** @} */ /* End of group USB_HTXE */

/** @defgroup Periph_USB_HFN_L USB HFN_L
  * @{
  */

/*-- USB_HFN_L:USB HFN_L Register -----*/

/* Bit field positions: */
#define USB_HFN_L_FNUM_Pos                                 0

/* Bit field masks: */
#define USB_HFN_L_FNUM_Msk                                 ((uint32_t)0x000000FF)

/** @} */ /* End of group USB_HFN_L */

/** @defgroup Periph_USB_HFN_H USB HFN_H
  * @{
  */

/*-- USB_HFN_H:USB HFN_H Register -----*/

/* Bit field positions: */
#define USB_HFN_H_FNUM_Pos                                 0

/* Bit field masks: */
#define USB_HFN_H_FNUM_Msk                                 ((uint32_t)0x00000007)

/** @} */ /* End of group USB_HFN_H */

/** @defgroup Periph_USB_HIS USB HIS
  * @{
  */

/*-- USB_HIS:USB HIS Register -----*/

/* Bit field positions: */
#define USB_HIS_TDONE_Pos                                  0
#define USB_HIS_RESUME_Pos                                 1
#define USB_HIS_CONEV_Pos                                  2
#define USB_HIS_SOFS_Pos                                   3

/* Bit field masks: */
#define USB_HIS_TDONE                                      ((uint32_t)0x00000001)
#define USB_HIS_RESUME                                     ((uint32_t)0x00000002)
#define USB_HIS_CONEV                                      ((uint32_t)0x00000004)
#define USB_HIS_SOFS                                       ((uint32_t)0x00000008)

/** @} */ /* End of group USB_HIS */

/** @defgroup Periph_USB_HIM USB HIM
  * @{
  */

/*-- USB_HIM:USB HIM Register -----*/

/* Bit field positions: */
#define USB_HIM_TDONEIE_Pos                                0
#define USB_HIM_RESUMEIE_Pos                               1
#define USB_HIM_CONEVIE_Pos                                2
#define USB_HIM_SOFIE_Pos                                  3

/* Bit field masks: */
#define USB_HIM_TDONEIE                                    ((uint32_t)0x00000001)
#define USB_HIM_RESUMEIE                                   ((uint32_t)0x00000002)
#define USB_HIM_CONEVIE                                    ((uint32_t)0x00000004)
#define USB_HIM_SOFIE                                      ((uint32_t)0x00000008)

/** @} */ /* End of group USB_HIM */

/** @defgroup Periph_USB_HRXS USB HRXS
  * @{
  */

/*-- USB_HRXS:USB HRXS Register -----*/

/* Bit field positions: */
#define USB_HRXS_CRCERR_Pos                                0
#define USB_HRXS_BSERR_Pos                                 1
#define USB_HRXS_RXOF_Pos                                  2
#define USB_HRXS_RXTO_Pos                                  3
#define USB_HRXS_NAKRXED_Pos                               4
#define USB_HRXS_STALLRXED_Pos                             5
#define USB_HRXS_ACKRXED_Pos                               6
#define USB_HRXS_DATASEQ_Pos                               7

/* Bit field masks: */
#define USB_HRXS_CRCERR                                    ((uint32_t)0x00000001)
#define USB_HRXS_BSERR                                     ((uint32_t)0x00000002)
#define USB_HRXS_RXOF                                      ((uint32_t)0x00000004)
#define USB_HRXS_RXTO                                      ((uint32_t)0x00000008)
#define USB_HRXS_NAKRXED                                   ((uint32_t)0x00000010)
#define USB_HRXS_STALLRXED                                 ((uint32_t)0x00000020)
#define USB_HRXS_ACKRXED                                   ((uint32_t)0x00000040)
#define USB_HRXS_DATASEQ                                   ((uint32_t)0x00000080)

/** @} */ /* End of group USB_HRXS */

/** @defgroup Periph_USB_HRXP USB HRXP
  * @{
  */

/*-- USB_HRXP:USB HRXP Register -----*/

/* Bit field positions: */
#define USB_HRXP_RPID_Pos                                  0

/* Bit field masks: */
#define USB_HRXP_RPID_Msk                                  ((uint32_t)0x0000000F)

/** @} */ /* End of group USB_HRXP */

/** @defgroup Periph_USB_HRXA USB HRXA
  * @{
  */

/*-- USB_HRXA:USB HRXA Register -----*/

/* Bit field positions: */
#define USB_HRXA_RADDR_Pos                                 0

/* Bit field masks: */
#define USB_HRXA_RADDR_Msk                                 ((uint32_t)0x0000007F)

/** @} */ /* End of group USB_HRXA */

/** @defgroup Periph_USB_HRXE USB HRXE
  * @{
  */

/*-- USB_HRXE:USB HRXE Register -----*/

/* Bit field positions: */
#define USB_HRXE_RENDP_Pos                                 0

/* Bit field masks: */
#define USB_HRXE_RENDP_Msk                                 ((uint32_t)0x0000000F)

/** @} */ /* End of group USB_HRXE */

/** @defgroup Periph_USB_HRXCS USB HRXCS
  * @{
  */

/*-- USB_HRXCS:USB HRXCS Register -----*/

/* Bit field positions: */
#define USB_HRXCS_RXLS_Pos                                 0

/* Bit field masks: */
#define USB_HRXCS_RXLS_Msk                                 ((uint32_t)0x00000003)

