ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR32FxQI/DeviceSupport/MDR32FG16S1QI/inc/MDR32FG16S1QI.h
/** @} */ /* End of group USB_HRXCS */

/** @defgroup Periph_USB_HSTM USB HSTM
  * @{
  */

/*-- USB_HSTM:USB HSTM Register -----*/

/* Bit field positions: */
#define USB_HSTM_HSTM_Pos                                  0

/* Bit field masks: */
#define USB_HSTM_HSTM_Msk                                  ((uint32_t)0x000000FF)

/** @} */ /* End of group USB_HSTM */

/** @defgroup Periph_USB_HRXFD USB HRXFD
  * @{
  */

/*-- USB_HRXFD:USB HRXFD Register -----*/

/* Bit field positions: */
#define USB_HRXFD_RXFIFODATA_Pos                           0

/* Bit field masks: */
#define USB_HRXFD_RXFIFODATA_Msk                           ((uint32_t)0x000000FF)

/** @} */ /* End of group USB_HRXFD */

/** @defgroup Periph_USB_HRXFDC_L USB HRXFDC_L
  * @{
  */

/*-- USB_HRXFDC_L:USB HRXFDC_L Register -----*/

/* Bit field positions: */
#define USB_HRXFDC_L_FIFODATACOUNT_Pos                     0

/* Bit field masks: */
#define USB_HRXFDC_L_FIFODATACOUNT_Msk                     ((uint32_t)0x000000FF)

/** @} */ /* End of group USB_HRXFDC_L */

/** @defgroup Periph_USB_HRXFDC_H USB HRXFDC_H
  * @{
  */

/*-- USB_HRXFDC_H:USB HRXFDC_H Register -----*/

/* Bit field positions: */
#define USB_HRXFDC_H_FIFODATACOUNT_Pos                     0

/* Bit field masks: */
#define USB_HRXFDC_H_FIFODATACOUNT_Msk                     ((uint32_t)0x000000FF)

/** @} */ /* End of group USB_HRXFDC_H */

/** @defgroup Periph_USB_HRXFC USB HRXFC
  * @{
  */

/*-- USB_HRXFC:USB HRXFC Register -----*/

/* Bit field positions: */
#define USB_HRXFC_FIFOFORCEEMPTY_Pos                       0

/* Bit field masks: */
#define USB_HRXFC_FIFOFORCEEMPTY                           ((uint32_t)0x00000001)

/** @} */ /* End of group USB_HRXFC */

/** @defgroup Periph_USB_HTXFD USB HTXFD
  * @{
  */

/*-- USB_HTXFD:USB HTXFD Register -----*/

/* Bit field positions: */
#define USB_HTXFD_TXFIFODATA_Pos                           0

/* Bit field masks: */
#define USB_HTXFD_TXFIFODATA_Msk                           ((uint32_t)0x000000FF)

/** @} */ /* End of group USB_HTXFD */

/** @defgroup Periph_USB_HTXFC USB HTXFC
  * @{
  */

/*-- USB_HTXFC:USB HTXFC Register -----*/

/* Bit field positions: */
#define USB_HTXFC_FIFOFORCEEMPTY_Pos                       0

/* Bit field masks: */
#define USB_HTXFC_FIFOFORCEEMPTY                           ((uint32_t)0x00000001)

/** @} */ /* End of group USB_HTXFC */

/** @defgroup Periph_USB_SEP_CTRL USB SEP_CTRL
  * @{
  */

/*-- USB_SEP_CTRL:USB SEP_CTRL Register -----*/

/* Bit field positions: */
#define USB_SEP_CTRL_EPEN_Pos                              0
#define USB_SEP_CTRL_EPRDY_Pos                             1
#define USB_SEP_CTRL_EPDATASEQ_Pos                         2
#define USB_SEP_CTRL_EPSSTALL_Pos                          3
#define USB_SEP_CTRL_EPISOEN_Pos                           4

/* Bit field masks: */
#define USB_SEP_CTRL_EPEN                                  ((uint32_t)0x00000001)
#define USB_SEP_CTRL_EPRDY                                 ((uint32_t)0x00000002)
#define USB_SEP_CTRL_EPDATASEQ                             ((uint32_t)0x00000004)
#define USB_SEP_CTRL_EPSSTALL                              ((uint32_t)0x00000008)
#define USB_SEP_CTRL_EPISOEN                               ((uint32_t)0x00000010)

/** @} */ /* End of group USB_SEP_CTRL */

/** @defgroup Periph_USB_SEP_STS USB SEP_STS
  * @{
  */

/*-- USB_SEP_STS:USB SEP_STS Register -----*/

/* Bit field positions: */
#define USB_SEP_STS_SCCRCERR_Pos                           0
#define USB_SEP_STS_SCBSERR_Pos                            1
#define USB_SEP_STS_SCRXOF_Pos                             2
#define USB_SEP_STS_SCRXTO_Pos                             3
#define USB_SEP_STS_SCNAKSENT_Pos                          4
#define USB_SEP_STS_SCSTALLSENT_Pos                        5
#define USB_SEP_STS_SCACKRXED_Pos                          6
#define USB_SEP_STS_SCDATASEQ_Pos                          7

/* Bit field masks: */
#define USB_SEP_STS_SCCRCERR                               ((uint32_t)0x00000001)
#define USB_SEP_STS_SCBSERR                                ((uint32_t)0x00000002)
#define USB_SEP_STS_SCRXOF                                 ((uint32_t)0x00000004)
#define USB_SEP_STS_SCRXTO                                 ((uint32_t)0x00000008)
#define USB_SEP_STS_SCNAKSENT                              ((uint32_t)0x00000010)
#define USB_SEP_STS_SCSTALLSENT                            ((uint32_t)0x00000020)
#define USB_SEP_STS_SCACKRXED                              ((uint32_t)0x00000040)
#define USB_SEP_STS_SCDATASEQ                              ((uint32_t)0x00000080)

/** @} */ /* End of group USB_SEP_STS */

/** @defgroup Periph_USB_SEP_TS USB SEP_TS
  * @{
  */

/*-- USB_SEP_TS:USB SEP_TS Register -----*/

/* Bit field positions: */
#define USB_SEP_TS_SCTTYPE_Pos                             0

/* Bit field masks: */
#define USB_SEP_TS_SCTTYPE_Msk                             ((uint32_t)0x00000003)

/** @} */ /* End of group USB_SEP_TS */

/** @defgroup Periph_USB_SEP_NTS USB SEP_NTS
  * @{
  */

/*-- USB_SEP_NTS:USB SEP_NTS Register -----*/

/* Bit field positions: */
#define USB_SEP_NTS_NTTYPE_Pos                             0

/* Bit field masks: */
#define USB_SEP_NTS_NTTYPE_Msk                             ((uint32_t)0x00000003)

/** @} */ /* End of group USB_SEP_NTS */

/** @defgroup Periph_USB_SC USB SC
  * @{
  */

/*-- USB_SC:USB SC Register -----*/

/* Bit field positions: */
#define USB_SCGEN_Pos                                   0
#define USB_SCTXLS_Pos                                  1
#define USB_SCDC_Pos                                    3
#define USB_SCFSP_Pos                                   4
#define USB_SCFSR_Pos                                   5

/* Bit field masks: */
#define USB_SCGEN                                       ((uint32_t)0x00000001)
#define USB_SCTXLS_Msk                                  ((uint32_t)0x00000006)
#define USB_SCDC                                        ((uint32_t)0x00000008)
#define USB_SCFSP                                       ((uint32_t)0x00000010)
#define USB_SCFSR                                       ((uint32_t)0x00000020)

/** @} */ /* End of group USB_SC */

/** @defgroup Periph_USB_SLS USB SLS
  * @{
  */

