ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR32FxQI/DeviceSupport/MDR32FG16S1QI/inc/MDR32FG16S1QI.h
/*-- USB_SLS:USB SLS Register -----*/

/* Bit field positions: */
#define USB_SLS_SCRXLS_Pos                                 0

/* Bit field masks: */
#define USB_SLS_SCRXLS_Msk                                 ((uint32_t)0x00000003)

/** @} */ /* End of group USB_SLS */

/** @defgroup Periph_USB_SIS USB SIS
  * @{
  */

/*-- USB_SIS:USB SIS Register -----*/

/* Bit field positions: */
#define USB_SIS_SCTDONE_Pos                                0
#define USB_SIS_SCRESUME_Pos                               1
#define USB_SIS_SCRESETEV_Pos                              2
#define USB_SIS_SCSOFREC_Pos                               3
#define USB_SIS_SCNAKSENT_Pos                              4

/* Bit field masks: */
#define USB_SIS_SCTDONE                                    ((uint32_t)0x00000001)
#define USB_SIS_SCRESUME                                   ((uint32_t)0x00000002)
#define USB_SIS_SCRESETEV                                  ((uint32_t)0x00000004)
#define USB_SIS_SCSOFREC                                   ((uint32_t)0x00000008)
#define USB_SIS_SCNAKSENT                                  ((uint32_t)0x00000010)

/** @} */ /* End of group USB_SIS */

/** @defgroup Periph_USB_SIM USB SIM
  * @{
  */

/*-- USB_SIM:USB SIM Register -----*/

/* Bit field positions: */
#define USB_SIM_SCTDONEIE_Pos                              0
#define USB_SIM_SCRESUMEIE_Pos                             1
#define USB_SIM_SCRESETEVIE_Pos                            2
#define USB_SIM_SCSOFRECIE_Pos                             3
#define USB_SIM_SCNAKSENTIE_Pos                            4

/* Bit field masks: */
#define USB_SIM_SCTDONEIE                                  ((uint32_t)0x00000001)
#define USB_SIM_SCRESUMEIE                                 ((uint32_t)0x00000002)
#define USB_SIM_SCRESETEVIE                                ((uint32_t)0x00000004)
#define USB_SIM_SCSOFRECIE                                 ((uint32_t)0x00000008)
#define USB_SIM_SCNAKSENTIE                                ((uint32_t)0x00000010)

/** @} */ /* End of group USB_SIM */

/** @defgroup Periph_USB_SA USB SA
  * @{
  */

/*-- USB_SA:USB SA Register -----*/

/* Bit field positions: */
#define USB_SA_SCDEVADDR_Pos                               0

/* Bit field masks: */
#define USB_SA_SCDEVADDR_Msk                               ((uint32_t)0x0000007F)

/** @} */ /* End of group USB_SA */

/** @defgroup Periph_USB_SFN_L USB SFN_L
  * @{
  */

/*-- USB_SFN_L:USB SFN_L Register -----*/

/* Bit field positions: */
#define USB_SFN_L_FRAMENUM_Pos                             0

/* Bit field masks: */
#define USB_SFN_L_FRAMENUM_Msk                             ((uint32_t)0x000000FF)

/** @} */ /* End of group USB_SFN_L */

/** @defgroup Periph_USB_SFN_H USB SFN_H
  * @{
  */

/*-- USB_SFN_H:USB SFN_H Register -----*/

/* Bit field positions: */
#define USB_SFN_H_FRAMENUM_Pos                             0

/* Bit field masks: */
#define USB_SFN_H_FRAMENUM_Msk                             ((uint32_t)0x00000007)

/** @} */ /* End of group USB_SFN_H */

/** @defgroup Periph_USB_SEP_FIFO_RXFD USB SEP_FIFO_RXFD
  * @{
  */

/*-- USB_SEP_FIFO_RXFD:USB SEP_FIFO_RXFD Register -----*/

/* Bit field positions: */
#define USB_SEP_FIFO_RXFD_RXFIFODATA_Pos                   0

/* Bit field masks: */
#define USB_SEP_FIFO_RXFD_RXFIFODATA_Msk                   ((uint32_t)0x000000FF)

/** @} */ /* End of group USB_SEP_FIFO_RXFD */

/** @defgroup Periph_USB_SEP_FIFO_RXFDC_L USB SEP_FIFO_RXFDC_L
  * @{
  */

/*-- USB_SEP_FIFO_RXFDC_L:USB SEP_FIFO_RXFDC_L Register -----*/

/* Bit field positions: */
#define USB_SEP_FIFO_RXFDC_L_FIFODATACOUNT_Pos             0

/* Bit field masks: */
#define USB_SEP_FIFO_RXFDC_L_FIFODATACOUNT_Msk             ((uint32_t)0x000000FF)

/** @} */ /* End of group USB_SEP_FIFO_RXFDC_L */

/** @defgroup Periph_USB_SEP_FIFO_RXFDC_H USB SEP_FIFO_RXFDC_H
  * @{
  */

/*-- USB_SEP_FIFO_RXFDC_H:USB SEP_FIFO_RXFDC_H Register -----*/

/* Bit field positions: */
#define USB_SEP_FIFO_RXFDC_H_FIFODATACOUNT_Pos             0

/* Bit field masks: */
#define USB_SEP_FIFO_RXFDC_H_FIFODATACOUNT_Msk             ((uint32_t)0x000000FF)

/** @} */ /* End of group USB_SEP_FIFO_RXFDC_H */

/** @defgroup Periph_USB_SEP_FIFO_RXFC USB SEP_FIFO_RXFC
  * @{
  */

/*-- USB_SEP_FIFO_RXFC:USB SEP_FIFO_RXFC Register -----*/

/* Bit field positions: */
#define USB_SEP_FIFO_RXFC_FIFOFORCEEMPTY_Pos               0

/* Bit field masks: */
#define USB_SEP_FIFO_RXFC_FIFOFORCEEMPTY                   ((uint32_t)0x00000001)

/** @} */ /* End of group USB_SEP_FIFO_RXFC */

/** @defgroup Periph_USB_SEP_FIFO_TXFD USB SEP_FIFO_TXFD
  * @{
  */

/*-- USB_SEP_FIFO_TXFD:USB SEP_FIFO_TXFD Register -----*/

/* Bit field positions: */
#define USB_SEP_FIFO_TXFD_TXFIFODATA_Pos                   0

/* Bit field masks: */
#define USB_SEP_FIFO_TXFD_TXFIFODATA_Msk                   ((uint32_t)0x000000FF)

/** @} */ /* End of group USB_SEP_FIFO_TXFD */

/** @defgroup Periph_USB_SEP_FIFO_TXFDC USB SEP_FIFO_TXFDC
  * @{
  */

/*-- USB_SEP_FIFO_TXFDC:USB SEP_FIFO_TXFDC Register -----*/

/* Bit field positions: */
#define USB_SEP_FIFO_TXFDC_FIFOFORCEEMPTY_Pos              0

/* Bit field masks: */
#define USB_SEP_FIFO_TXFDC_FIFOFORCEEMPTY                  ((uint32_t)0x00000001)

/** @} */ /* End of group USB_SEP_FIFO_TXFDC */

/** @defgroup Periph_USB_HSCR USB HSCR
  * @{
  */

/*-- USB_HSCR:USB HSCR Register -----*/

/* Bit field positions: */
#define USB_HSCR_HOST_MODE_Pos                             0
#define USB_HSCR_RESET_CORE_Pos                            1
#define USB_HSCR_EN_TX_Pos                                 2
#define USB_HSCR_EN_RX_Pos                                 3
#define USB_HSCR_DP_PULLUP_Pos                             4
#define USB_HSCR_DP_PULLDOWN_Pos                           5
#define USB_HSCR_DM_PULLUP_Pos                             6
#define USB_HSCR_DM_PULLDOWN_Pos                           7

/* Bit field masks: */
#define USB_HSCR_HOST_MODE                                 ((uint32_t)0x00000001)
#define USB_HSCR_RESET_CORE                                ((uint32_t)0x00000002)
#define USB_HSCR_EN_TX                                     ((uint32_t)0x00000004)
#define USB_HSCR_EN_RX                                     ((uint32_t)0x00000008)
#define USB_HSCR_DP_PULLUP                                 ((uint32_t)0x00000010)
#define USB_HSCR_DP_PULLDOWN                               ((uint32_t)0x00000020)
#define USB_HSCR_DM_PULLUP                                 ((uint32_t)0x00000040)
#define USB_HSCR_DM_PULLDOWN                               ((uint32_t)0x00000080)

/** @} */ /* End of group USB_HSCR */

/** @defgroup Periph_USB_HSVR USB HSVR
  * @{
  */

