ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR32FxQI/DeviceSupport/MDR32FG16S1QI/inc/MDR32FG16S1QI.h
/** @} */ /* End of group SDIO_CR */

/** @defgroup Periph_SDIO_SR SDIO SR
  * @{
  */

/*-- SDIO_SR:SDIO SR Register -----*/

/* Bit field positions: */
#define SDIO_SR_FIFOCMD_EMPTY_Pos                          0
#define SDIO_SR_FIFODAT_EMPTY_Pos                          1
#define SDIO_SR_FIFOCMD_FULL_Pos                           2
#define SDIO_SR_FIFODAT_FULL_Pos                           3

/* Bit field masks: */
#define SDIO_SR_FIFOCMD_EMPTY                              ((uint32_t)0x00000001)
#define SDIO_SR_FIFODAT_EMPTY                              ((uint32_t)0x00000002)
#define SDIO_SR_FIFOCMD_FULL                               ((uint32_t)0x00000004)
#define SDIO_SR_FIFODAT_FULL                               ((uint32_t)0x00000008)

/** @} */ /* End of group SDIO_SR */

/** @defgroup Periph_SDIO_CMDDR SDIO CMDDR
  * @{
  */

/*-- SDIO_CMDDR:SDIO CMDDR Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group SDIO_CMDDR */

/** @defgroup Periph_SDIO_DATDR SDIO DATDR
  * @{
  */

/*-- SDIO_DATDR:SDIO DATDR Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group SDIO_DATDR */

/** @defgroup Periph_SDIO_CMDCRC SDIO CMDCRC
  * @{
  */

/*-- SDIO_CMDCRC:SDIO CMDCRC Register -----*/

/* Bit field positions: */
#define SDIO_CMDCRC_CMDCRC_Pos                             0

/* Bit field masks: */
#define SDIO_CMDCRC_CMDCRC_Msk                             ((uint32_t)0x0000007F)

/** @} */ /* End of group SDIO_CMDCRC */

/** @defgroup Periph_SDIO_DAT0CRC SDIO DAT0CRC
  * @{
  */

/*-- SDIO_DAT0CRC:SDIO DAT0CRC Register -----*/

/* Bit field positions: */
#define SDIO_DAT0CRC_DAT0CRC_Pos                           0

/* Bit field masks: */
#define SDIO_DAT0CRC_DAT0CRC_Msk                           ((uint32_t)0x0000FFFF)

/** @} */ /* End of group SDIO_DAT0CRC */

/** @defgroup Periph_SDIO_DAT1CRC SDIO DAT1CRC
  * @{
  */

/*-- SDIO_DAT1CRC:SDIO DAT1CRC Register -----*/

/* Bit field positions: */
#define SDIO_DAT1CRC_DAT1CRC_Pos                           0

/* Bit field masks: */
#define SDIO_DAT1CRC_DAT1CRC_Msk                           ((uint32_t)0x0000FFFF)

/** @} */ /* End of group SDIO_DAT1CRC */

/** @defgroup Periph_SDIO_DAT2CRC SDIO DAT2CRC
  * @{
  */

/*-- SDIO_DAT2CRC:SDIO DAT2CRC Register -----*/

/* Bit field positions: */
#define SDIO_DAT2CRC_DAT2CRC_Pos                           0

/* Bit field masks: */
#define SDIO_DAT2CRC_DAT2CRC_Msk                           ((uint32_t)0x0000FFFF)

/** @} */ /* End of group SDIO_DAT2CRC */

/** @defgroup Periph_SDIO_DAT3CRC SDIO DAT3CRC
  * @{
  */

/*-- SDIO_DAT3CRC:SDIO DAT3CRC Register -----*/

/* Bit field positions: */
#define SDIO_DAT3CRC_DAT3CRC_Pos                           0

/* Bit field masks: */
#define SDIO_DAT3CRC_DAT3CRC_Msk                           ((uint32_t)0x0000FFFF)

/** @} */ /* End of group SDIO_DAT3CRC */

/** @defgroup Periph_SDIO_CMD_TRANSFER SDIO CMD_TRANSFER
  * @{
  */

/*-- SDIO_CMD_TRANSFER:SDIO CMD_TRANSFER Register -----*/

/* Bit field positions: */
#define SDIO_CMD_TRANSFER_CMD_TRANSFER_Pos                 0

/* Bit field masks: */
#define SDIO_CMD_TRANSFER_CMD_TRANSFER_Msk                 ((uint32_t)0x0000FFFF)

/** @} */ /* End of group SDIO_CMD_TRANSFER */

/** @defgroup Periph_SDIO_DAT_TRANSFER SDIO DAT_TRANSFER
  * @{
  */

/*-- SDIO_DAT_TRANSFER:SDIO DAT_TRANSFER Register -----*/

/* Bit field positions: */
#define SDIO_DAT_TRANSFER_DAT_TRANSFER_Pos                 0

/* Bit field masks: */
#define SDIO_DAT_TRANSFER_DAT_TRANSFER_Msk                 ((uint32_t)0x0000FFFF)

/** @} */ /* End of group SDIO_DAT_TRANSFER */

/** @} */ /* End of group SDIO */

/** @defgroup MDR32FG16S1QI_Periph_I2C I2C
  * @{
  */


/* MDR_I2Cx_TypeDef structure */
typedef struct {
	__IO uint32_t	PRL;                    /*!<I2C Prescaler (low byte) Register */
	__IO uint32_t	PRH;                    /*!<I2C Prescaler (high byte) Register */
	__IO uint32_t	CTR;                    /*!<I2C Control Register */
	__IO uint32_t	RXD;                    /*!<I2C Received Data Register */
	__IO uint32_t	STA;                    /*!<I2C Status Register */
	__IO uint32_t	TXD;                    /*!<I2C Transmitted Data Register */
	__IO uint32_t	CMD;                    /*!<I2C Command Register */
}MDR_I2C_TypeDef;

/** @defgroup Periph_I2C_PRL I2C PRL
  * @{
  */

/*-- I2C_PRL:I2C PRL Register -----*/

/* Bit field positions: */
#define I2C_PRL_PR_Pos                                     0

/* Bit field masks: */
#define I2C_PRL_PR_Msk                                     ((uint32_t)0x000000FF)

/** @} */ /* End of group I2C_PRL */

/** @defgroup Periph_I2C_PRH I2C PRH
  * @{
  */

/*-- I2C_PRH:I2C PRH Register -----*/

/* Bit field positions: */
#define I2C_PRH_PR_Pos                                     0

/* Bit field masks: */
#define I2C_PRH_PR_Msk                                     ((uint32_t)0x000000FF)

/** @} */ /* End of group I2C_PRH */

/** @defgroup Periph_I2C_CTR I2C CTR
  * @{
  */

/*-- I2C_CTR:I2C CTR Register -----*/

/* Bit field positions: */
#define I2C_CTR_S_I2C_Pos                                  5
#define I2C_CTR_EN_INT_Pos                                 6
#define I2C_CTR_EN_I2C_Pos                                 7

/* Bit field masks: */
#define I2C_CTR_S_I2C                                      ((uint32_t)0x00000020)
#define I2C_CTR_EN_INT                                     ((uint32_t)0x00000040)
#define I2C_CTR_EN_I2C                                     ((uint32_t)0x00000080)

/** @} */ /* End of group I2C_CTR */

/** @defgroup Periph_I2C_RXD I2C RXD
  * @{
  */

/*-- I2C_RXD:I2C RXD Register -----*/

/* Bit field positions: */
#define I2C_RXD_RXD_Pos                                    0

/* Bit field masks: */
#define I2C_RXD_RXD_Msk                                    ((uint32_t)0x000000FF)

/** @} */ /* End of group I2C_RXD */

/** @defgroup Periph_I2C_STA I2C STA
  * @{
  */

/*-- I2C_STA:I2C STA Register -----*/

/* Bit field positions: */
#define I2C_STA_INT_Pos                                    0
#define I2C_STA_TR_PROG_Pos                                1
#define I2C_STA_LOST_ARB_Pos                               5
#define I2C_STA_BUSY_Pos                                   6
#define I2C_STA_RX_ACK_Pos                                 7

/* Bit field masks: */
#define I2C_STA_INT                                        ((uint32_t)0x00000001)
#define I2C_STA_TR_PROG                                    ((uint32_t)0x00000002)
#define I2C_STA_LOST_ARB                                   ((uint32_t)0x00000020)
#define I2C_STA_BUSY                                       ((uint32_t)0x00000040)
#define I2C_STA_RX_ACK                                     ((uint32_t)0x00000080)

