ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR32FxQI/DeviceSupport/MDR32FG16S1QI/inc/MDR32FG16S1QI.h
/** @defgroup Periph_BKP_RTC_CNT BKP RTC_CNT
  * @{
  */

/*-- BKP_RTC_CNT:BKP RTC_CNT Register -----*/

/* Bit field positions: */
#define BKP_RTC_CNT_RTC_CNT_Pos                            0

/* Bit field masks: */
#define BKP_RTC_CNT_RTC_CNT_Msk                            ((uint32_t)0xFFFFFFFF)

/** @} */ /* End of group BKP_RTC_CNT */

/** @defgroup Periph_BKP_RTC_DIV BKP RTC_DIV
  * @{
  */

/*-- BKP_RTC_DIV:BKP RTC_DIV Register -----*/

/* Bit field positions: */
#define BKP_RTC_DIV_RTC_DIV_Pos                            0

/* Bit field masks: */
#define BKP_RTC_DIV_RTC_DIV_Msk                            ((uint32_t)0x000FFFFF)

/** @} */ /* End of group BKP_RTC_DIV */

/** @defgroup Periph_BKP_RTC_PRL BKP RTC_PRL
  * @{
  */

/*-- BKP_RTC_PRL:BKP RTC_PRL Register -----*/

/* Bit field positions: */
#define BKP_RTC_PRL_RTC_PRL_Pos                            0

/* Bit field masks: */
#define BKP_RTC_PRL_RTC_PRL_Msk                            ((uint32_t)0x000FFFFF)

/** @} */ /* End of group BKP_RTC_PRL */

/** @defgroup Periph_BKP_RTC_ALRM BKP RTC_ALRM
  * @{
  */

/*-- BKP_RTC_ALRM:BKP RTC_ALRM Register -----*/

/* Bit field positions: */
#define BKP_RTC_ALRM_RTC_ALRM_Pos                          0

/* Bit field masks: */
#define BKP_RTC_ALRM_RTC_ALRM_Msk                          ((uint32_t)0xFFFFFFFF)

/** @} */ /* End of group BKP_RTC_ALRM */

/** @defgroup Periph_BKP_RTC_CS BKP RTC_CS
  * @{
  */

/*-- BKP_RTC_CS:BKP RTC_CS Register -----*/

/* Bit field positions: */
#define BKP_RTC_CS_OWF_Pos                                 0
#define BKP_RTC_CS_SECF_Pos                                1
#define BKP_RTC_CS_ALRF_Pos                                2
#define BKP_RTC_CS_OWF_IE_Pos                              3
#define BKP_RTC_CS_SECF_IE_Pos                             4
#define BKP_RTC_CS_ALRF_IE_Pos                             5
#define BKP_RTC_CS_WEC_Pos                                 6

/* Bit field masks: */
#define BKP_RTC_CS_OWF                                     ((uint32_t)0x00000001)
#define BKP_RTC_CS_SECF                                    ((uint32_t)0x00000002)
#define BKP_RTC_CS_ALRF                                    ((uint32_t)0x00000004)
#define BKP_RTC_CS_Msk                                     ((uint32_t)0x00000007)
#define BKP_RTC_CS_OWF_IE                                  ((uint32_t)0x00000008)
#define BKP_RTC_CS_SECF_IE                                 ((uint32_t)0x00000010)
#define BKP_RTC_CS_ALRF_IE                                 ((uint32_t)0x00000020)
#define BKP_RTC_CS_IE_Msk                                  ((uint32_t)0x00000038)
#define BKP_RTC_CS_WEC                                     ((uint32_t)0x00000040)

/** @} */ /* End of group BKP_RTC_CS */

/** @} */ /* End of group BKP */

/** @defgroup MDR32FG16S1QI_Periph_EBC EBC
  * @{
  */


/* MDR_EBC_TypeDef structure */
typedef struct {
	__I  uint32_t	RESERVED0[20];
	__IO uint32_t	NAND_CYCLES;            /*!<EBC NAND Timing Register */
	__IO uint32_t	CONTROL;                /*!<EBC Control Register */
}MDR_EBC_TypeDef;

/** @defgroup Periph_EBC_NAND_CYCLES EBC NAND_CYCLES
  * @{
  */

/*-- EBC_NAND_CYCLES:EBC NAND_CYCLES Register -----*/

/* Bit field positions: */
#define EBC_NAND_CYCLES_TRC_Pos                            0
#define EBC_NAND_CYCLES_TWC_Pos                            4
#define EBC_NAND_CYCLES_TREA_Pos                           8
#define EBC_NAND_CYCLES_TWP_Pos                            12
#define EBC_NAND_CYCLES_TWHR_Pos                           16
#define EBC_NAND_CYCLES_TALEA_Pos                          20
#define EBC_NAND_CYCLES_TRR_Pos                            24

/* Bit field masks: */
#define EBC_NAND_CYCLES_TRC_Msk                            ((uint32_t)0x0000000F)
#define EBC_NAND_CYCLES_TWC_Msk                            ((uint32_t)0x000000F0)
#define EBC_NAND_CYCLES_TREA_Msk                           ((uint32_t)0x00000F00)
#define EBC_NAND_CYCLES_TWP_Msk                            ((uint32_t)0x0000F000)
#define EBC_NAND_CYCLES_TWHR_Msk                           ((uint32_t)0x000F0000)
#define EBC_NAND_CYCLES_TALEA_Msk                          ((uint32_t)0x00F00000)
#define EBC_NAND_CYCLES_TRR_Msk                            ((uint32_t)0x0F000000)

/** @} */ /* End of group EBC_NAND_CYCLES */

/** @defgroup Periph_EBC_CONTROL EBC CONTROL
  * @{
  */

/*-- EBC_CONTROL:EBC CONTROL Register -----*/

/* Bit field positions: */
#define EBC_CONTROL_ROM_Pos                                0
#define EBC_CONTROL_RAM_Pos                                1
#define EBC_CONTROL_NAND_Pos                               2
#define EBC_CONTROL_CPOL_Pos                               3
#define EBC_CONTROL_BUSY_Pos                               7
#define EBC_CONTROL_WAIT_STATE_Pos                         12

/* Bit field masks: */
#define EBC_CONTROL_ROM                                    ((uint32_t)0x00000001)
#define EBC_CONTROL_RAM                                    ((uint32_t)0x00000002)
#define EBC_CONTROL_NAND                                   ((uint32_t)0x00000004)
#define EBC_CONTROL_CPOL                                   ((uint32_t)0x00000008)
#define EBC_CONTROL_BUSY                                   ((uint32_t)0x00000080)
#define EBC_CONTROL_WAIT_STATE_Msk                         ((uint32_t)0x0000F000)

/** @} */ /* End of group EBC_CONTROL */

/** @} */ /* End of group EBC */

/** @defgroup MDR32FG16S1QI_Periph_DSP_CORE DSP_CORE
  * @{
  */


/* MDR_DSP_CORE_TypeDef structure */
typedef struct {
	__I  uint32_t	RESERVED0[47];
	__IO uint32_t	CLKCMD;                 /*!< */
	//__IO uint32_t	DIR;                    /*!< not correct*/
	//__IO uint32_t	AIR;                    /*!< not correct*/
}MDR_DSP_CORE_TypeDef;

/** @defgroup Periph_DSP_CORE_CLKCMD DSP_CORE CLKCMD
  * @{
  */

/*-- DSP_CORE_CLKCMD:DSP_CORE CLKCMD Register -----*/

/* Bit field positions: */
#define DSP_CORE_CLKCMD_CRP_Pos                            3
#define DSP_CORE_CLKCMD_CDC_Pos                            4
#define DSP_CORE_CLKCMD_TMR_Pos                            5
#define DSP_CORE_CLKCMD_DMA_Pos                            6
#define DSP_CORE_CLKCMD_MC3_Pos                            7
#define DSP_CORE_CLKCMD_PC3_Pos                            8
#define DSP_CORE_CLKCMD_MC2_Pos                            9
#define DSP_CORE_CLKCMD_PC2_Pos                            10
#define DSP_CORE_CLKCMD_MC1_Pos                            11
#define DSP_CORE_CLKCMD_PC1_Pos                            12
#define DSP_CORE_CLKCMD_CDM_Pos                            13
#define DSP_CORE_CLKCMD_CPM_Pos                            14
#define DSP_CORE_CLKCMD_CPU_Pos                            15

/* Bit field masks: */
#define DSP_CORE_CLKCMD_CRP                                ((uint32_t)0x00000008)
#define DSP_CORE_CLKCMD_CDC                                ((uint32_t)0x00000010)
#define DSP_CORE_CLKCMD_TMR                                ((uint32_t)0x00000020)
#define DSP_CORE_CLKCMD_DMA                                ((uint32_t)0x00000040)
#define DSP_CORE_CLKCMD_MC3                                ((uint32_t)0x00000080)
#define DSP_CORE_CLKCMD_PC3                                ((uint32_t)0x00000100)
#define DSP_CORE_CLKCMD_MC2                                ((uint32_t)0x00000200)
#define DSP_CORE_CLKCMD_PC2                                ((uint32_t)0x00000400)
#define DSP_CORE_CLKCMD_MC1                                ((uint32_t)0x00000800)
#define DSP_CORE_CLKCMD_PC1                                ((uint32_t)0x00001000)
#define DSP_CORE_CLKCMD_CDM                                ((uint32_t)0x00002000)
#define DSP_CORE_CLKCMD_CPM                                ((uint32_t)0x00004000)
#define DSP_CORE_CLKCMD_CPU                                ((uint32_t)0x00008000)

/** @} */ /* End of group DSP_CORE_CLKCMD */

/* MDR_DSP_IRQ_TypeDef structure */
typedef struct {                 /*!< */
	__IO uint16_t	DIR;                    /*!<*/
	__IO uint16_t	AIR;                    /*!<*/
}MDR_DSP_IRQ_TypeDef;



