ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR32FxQI/DeviceSupport/MDR32FG16S1QI/inc/MDR32FG16S1QI.h
/** @defgroup Periph_DSP_CORE_DIR DSP_CORE DIR
  * @{
  */

/*-- DSP_CORE_DIR:DSP_CORE DIR Register -----*/

/* Bit field positions: */
#define DSP_CORE_DIR_DIRQ0_Pos                             0
#define DSP_CORE_DIR_DIRQ1_Pos                             1
#define DSP_CORE_DIR_DIRQ2_Pos                             2
#define DSP_CORE_DIR_DIRQ3_Pos                             3
#define DSP_CORE_DIR_TIR_Pos                               4
#define DSP_CORE_DIR_RIRQ1_Pos                             5
#define DSP_CORE_DIR_XIRQ1_Pos                             6
#define DSP_CORE_DIR_RIRQ2_Pos                             7
#define DSP_CORE_DIR_XIRQ2_Pos                             8
#define DSP_CORE_DIR_RIRQ3_Pos                             9
#define DSP_CORE_DIR_XIRQ3_Pos                             10
#define DSP_CORE_DIR_CDIRQ_Pos                             11
#define DSP_CORE_DIR_CRIRQ_Pos                             12
#define DSP_CORE_DIR_DMAIRQ_Pos                            13
#define DSP_CORE_DIR_SNR_Pos                               15

/* Bit field masks: */
#define DSP_CORE_DIR_DIRQ0                                 ((uint32_t)0x00000001)
#define DSP_CORE_DIR_DIRQ1                                 ((uint32_t)0x00000002)
#define DSP_CORE_DIR_DIRQ2                                 ((uint32_t)0x00000004)
#define DSP_CORE_DIR_DIRQ3                                 ((uint32_t)0x00000008)
#define DSP_CORE_DIR_TIR                                   ((uint32_t)0x00000010)
#define DSP_CORE_DIR_RIRQ1                                 ((uint32_t)0x00000020)
#define DSP_CORE_DIR_XIRQ1                                 ((uint32_t)0x00000040)
#define DSP_CORE_DIR_RIRQ2                                 ((uint32_t)0x00000080)
#define DSP_CORE_DIR_XIRQ2                                 ((uint32_t)0x00000100)
#define DSP_CORE_DIR_RIRQ3                                 ((uint32_t)0x00000200)
#define DSP_CORE_DIR_XIRQ3                                 ((uint32_t)0x00000400)
#define DSP_CORE_DIR_CDIRQ                                 ((uint32_t)0x00000800)
#define DSP_CORE_DIR_CRIRQ                                 ((uint32_t)0x00001000)
#define DSP_CORE_DIR_DMAIRQ                                ((uint32_t)0x00002000)
#define DSP_CORE_DIR_SNR                                   ((uint32_t)0x00008000)

/** @} */ /* End of group DSP_CORE_DIR */

/** @defgroup Periph_DSP_CORE_AIR DSP_CORE AIR
  * @{
  */

/*-- DSP_CORE_AIR:DSP_CORE AIR Register -----*/

/* Bit field positions: */
#define DSP_CORE_AIR_AIRQ0_Pos                             0
#define DSP_CORE_AIR_AIRQ1_Pos                             1
#define DSP_CORE_AIR_AIRQ2_Pos                             2
#define DSP_CORE_AIR_AIRQ3_Pos                             3
#define DSP_CORE_AIR_ANMI_Pos                              4
#define DSP_CORE_AIR_ADMARQ0_Pos                           6
#define DSP_CORE_AIR_ADMARQ1_Pos                           7
#define DSP_CORE_AIR_ADMARQ2_Pos                           8
#define DSP_CORE_AIR_ADMARQ3_Pos                           9
#define DSP_CORE_AIR_ADMADONE0_Pos                         10
#define DSP_CORE_AIR_ADMADONE1_Pos                         11
#define DSP_CORE_AIR_ADMADONE2_Pos                         12
#define DSP_CORE_AIR_ADMADONE3_Pos                         13
#define DSP_CORE_AIR_SID_Pos                               14
#define DSP_CORE_AIR_SNR_Pos                               15

/* Bit field masks: */
#define DSP_CORE_AIR_AIRQ0                                 ((uint32_t)0x00000001)
#define DSP_CORE_AIR_AIRQ1                                 ((uint32_t)0x00000002)
#define DSP_CORE_AIR_AIRQ2                                 ((uint32_t)0x00000004)
#define DSP_CORE_AIR_AIRQ3                                 ((uint32_t)0x00000008)
#define DSP_CORE_AIR_ANMI                                  ((uint32_t)0x00000010)
#define DSP_CORE_AIR_ADMARQ0                               ((uint32_t)0x00000040)
#define DSP_CORE_AIR_ADMARQ1                               ((uint32_t)0x00000080)
#define DSP_CORE_AIR_ADMARQ2                               ((uint32_t)0x00000100)
#define DSP_CORE_AIR_ADMARQ3                               ((uint32_t)0x00000200)
#define DSP_CORE_AIR_ADMADONE0                             ((uint32_t)0x00000400)
#define DSP_CORE_AIR_ADMADONE1                             ((uint32_t)0x00000800)
#define DSP_CORE_AIR_ADMADONE2                             ((uint32_t)0x00001000)
#define DSP_CORE_AIR_ADMADONE3                             ((uint32_t)0x00002000)
#define DSP_CORE_AIR_SID                                   ((uint32_t)0x00004000)
#define DSP_CORE_AIR_SNR                                   ((uint32_t)0x00008000)

/** @} */ /* End of group DSP_CORE_AIR */

/** @} */ /* End of group DSP_CORE */

/** @defgroup MDR32FG16S1QI_Periph_AUDIO_IP AUDIO_IP
  * @{
  */


/* MDR_AUDIO_IP_TypeDef structure */
typedef struct {
	__IO uint32_t	POWCTL;                 /*!<AUDIO control register */
	__IO uint32_t	ADCCTL;                 /*!<ADC control register */
	__IO uint32_t	DACCTL;                 /*!<DAC control register */
	__IO uint32_t	MASKCTL;                /*!<IRQ mask register */
	__IO uint32_t	IRQFLAG;                /*!<IRQ flag register */
	__IO uint32_t	ADCREG;                 /*!<ADC FIFO register */
	__IO uint32_t	DACREG;                 /*!<DAC FIFO register */
}MDR_AUDIO_IP_TypeDef;

/** @defgroup Periph_AUDIO_IP_POWCTL AUDIO_IP POWCTL
  * @{
  */

/*-- AUDIO_IP_POWCTL:AUDIO_IP POWCTL Register -----*/

/* Bit field positions: */
#define AUDIO_IP_POWCTL_ADCEN_Pos                          0
#define AUDIO_IP_POWCTL_DACEN_Pos                          1
#define AUDIO_IP_POWCTL_IIREN_Pos                          2
#define AUDIO_IP_POWCTL_ALB_Pos                            3
#define AUDIO_IP_POWCTL_DLB_Pos                            4

/* Bit field masks: */
#define AUDIO_IP_POWCTL_ADCEN                              ((uint32_t)0x00000001)
#define AUDIO_IP_POWCTL_DACEN                              ((uint32_t)0x00000002)
#define AUDIO_IP_POWCTL_IIREN                              ((uint32_t)0x00000004)
#define AUDIO_IP_POWCTL_ALB                                ((uint32_t)0x00000008)
#define AUDIO_IP_POWCTL_DLB                                ((uint32_t)0x00000010)

