ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR32FxQI/DeviceSupport/MDR32FG16S1QI/inc/MDR32FG16S1QI.h
/** @} */ /* End of group AUDIO_IP_POWCTL */

/** @defgroup Periph_AUDIO_IP_ADCCTL AUDIO_IP ADCCTL
  * @{
  */

/*-- AUDIO_IP_ADCCTL:AUDIO_IP ADCCTL Register -----*/

/* Bit field positions: */
#define AUDIO_IP_ADCCTL_ADGAIN_Pos                         0
#define AUDIO_IP_ADCCTL_INBG_Pos                           6
#define AUDIO_IP_ADCCTL_AINSEL_Pos                         8
#define AUDIO_IP_ADCCTL_ICONT_Pos                          10

/* Bit field masks: */
#define AUDIO_IP_ADCCTL_ADGAIN_Msk                         ((uint32_t)0x0000003F)
#define AUDIO_IP_ADCCTL_INBG_Msk                           ((uint32_t)0x000000C0)
#define AUDIO_IP_ADCCTL_AINSEL_Msk                         ((uint32_t)0x00000300)
#define AUDIO_IP_ADCCTL_ICONT                              ((uint32_t)0x00000400)

/** @} */ /* End of group AUDIO_IP_ADCCTL */

/** @defgroup Periph_AUDIO_IP_DACCTL AUDIO_IP DACCTL
  * @{
  */

/*-- AUDIO_IP_DACCTL:AUDIO_IP DACCTL Register -----*/

/* Bit field positions: */
#define AUDIO_IP_DACCTL_DAGAIN_Pos                         0
#define AUDIO_IP_DACCTL_MUTE1_Pos                          6
#define AUDIO_IP_DACCTL_ODAMP_Pos                          7
#define AUDIO_IP_DACCTL_ODBIAS_Pos                         8
#define AUDIO_IP_DACCTL_ODDAC_Pos                          9
#define AUDIO_IP_DACCTL_OVECBA_Pos                         10
#define AUDIO_IP_DACCTL_OVECBS_Pos                         11
#define AUDIO_IP_DACCTL_SIDETONE_Pos                       12
#define AUDIO_IP_DACCTL_DACRES_Pos                         15

/* Bit field masks: */
#define AUDIO_IP_DACCTL_DAGAIN_Msk                         ((uint32_t)0x0000003F)
#define AUDIO_IP_DACCTL_MUTE1                              ((uint32_t)0x00000040)
#define AUDIO_IP_DACCTL_ODAMP                              ((uint32_t)0x00000080)
#define AUDIO_IP_DACCTL_ODBIAS                             ((uint32_t)0x00000100)
#define AUDIO_IP_DACCTL_ODDAC                              ((uint32_t)0x00000200)
#define AUDIO_IP_DACCTL_OVECBA                             ((uint32_t)0x00000400)
#define AUDIO_IP_DACCTL_OVECBS                             ((uint32_t)0x00000800)
#define AUDIO_IP_DACCTL_SIDETONE_Msk                       ((uint32_t)0x00007000)
#define AUDIO_IP_DACCTL_DACRES                             ((uint32_t)0x00008000)

/** @} */ /* End of group AUDIO_IP_DACCTL */

/** @defgroup Periph_AUDIO_IP_MASKCTL AUDIO_IP MASKCTL
  * @{
  */

/*-- AUDIO_IP_MASKCTL:AUDIO_IP MASKCTL Register -----*/

/* Bit field positions: */
#define AUDIO_IP_MASKCTL_DAOVFM_Pos                        0
#define AUDIO_IP_MASKCTL_ADCVFM_Pos                        1
#define AUDIO_IP_MASKCTL_ADCNSM_Pos                        2
#define AUDIO_IP_MASKCTL_DACNSM_Pos                        3
#define AUDIO_IP_MASKCTL_OVERCURM_Pos                      4

/* Bit field masks: */
#define AUDIO_IP_MASKCTL_DAOVFM                            ((uint32_t)0x00000001)
#define AUDIO_IP_MASKCTL_ADCVFM                            ((uint32_t)0x00000002)
#define AUDIO_IP_MASKCTL_ADCNSM                            ((uint32_t)0x00000004)
#define AUDIO_IP_MASKCTL_DACNSM                            ((uint32_t)0x00000008)
#define AUDIO_IP_MASKCTL_OVERCURM                          ((uint32_t)0x00000010)

/** @} */ /* End of group AUDIO_IP_MASKCTL */

/** @defgroup Periph_AUDIO_IP_IRQFLAG AUDIO_IP IRQFLAG
  * @{
  */

/*-- AUDIO_IP_IRQFLAG:AUDIO_IP IRQFLAG Register -----*/

/* Bit field positions: */
#define AUDIO_IP_IRQFLAG_DAOVF_Pos                         0
#define AUDIO_IP_IRQFLAG_ADCVF_Pos                         1
#define AUDIO_IP_IRQFLAG_ADCNS_Pos                         2
#define AUDIO_IP_IRQFLAG_DACNS_Pos                         3
#define AUDIO_IP_IRQFLAG_OVERVCUR_Pos                      4

/* Bit field masks: */
#define AUDIO_IP_IRQFLAG_DAOVF                             ((uint32_t)0x00000001)
#define AUDIO_IP_IRQFLAG_ADCVF                             ((uint32_t)0x00000002)
#define AUDIO_IP_IRQFLAG_ADCNS                             ((uint32_t)0x00000004)
#define AUDIO_IP_IRQFLAG_DACNS                             ((uint32_t)0x00000008)
#define AUDIO_IP_IRQFLAG_OVERVCUR                          ((uint32_t)0x00000010)

/** @} */ /* End of group AUDIO_IP_IRQFLAG */

/** @defgroup Periph_AUDIO_IP_ADCREG AUDIO_IP ADCREG
  * @{
  */

/*-- AUDIO_IP_ADCREG:AUDIO_IP ADCREG Register -----*/

/* Bit field positions: */
#define AUDIO_IP_ADCREG_ADCSMP_Pos                         0

/* Bit field masks: */
#define AUDIO_IP_ADCREG_ADCSMP_Msk                         ((uint32_t)0x0000FFFF)

/** @} */ /* End of group AUDIO_IP_ADCREG */

/** @defgroup Periph_AUDIO_IP_DACREG AUDIO_IP DACREG
  * @{
  */

/*-- AUDIO_IP_DACREG:AUDIO_IP DACREG Register -----*/

/* Bit field positions: */
#define AUDIO_IP_DACREG_DACSMP_Pos                         0

/* Bit field masks: */
#define AUDIO_IP_DACREG_DACSMP_Msk                         ((uint32_t)0x0000FFFF)

/** @} */ /* End of group AUDIO_IP_DACREG */

/** @} */ /* End of group AUDIO_IP */

/** @defgroup MDR32FG16S1QI_Periph_MCBSP MCBSP
  * @{
  */


/* MDR_MCBSPx_TypeDef structure */
typedef struct {
	__IO uint32_t	DRR;                    /*!< */
	__IO uint32_t	DXR;                    /*!< */
	__IO uint32_t	SPSA;                   /*!< */
	__IO uint32_t	SPCR;                   /*!< */
	__IO uint32_t	RCR;                    /*!< */
	__IO uint32_t	XCR;                    /*!< */
	__IO uint32_t	SRGR;                   /*!< */
	__IO uint32_t	MCR;                    /*!< */
	__IO uint32_t	XCER;                   /*!< */
	__IO uint32_t	RCER;                   /*!< */
	__IO uint32_t	PCR_SPSR;               /*!< */
}MDR_MCBSP_TypeDef;

/** @defgroup Periph_MCBSP_DRR MCBSP DRR
  * @{
  */

/*-- MCBSP_DRR:MCBSP DRR Register -----*/

/* Bit field positions: */
#define MCBSP_DRR_DATA_RX_Pos                              0

/* Bit field masks: */
#define MCBSP_DRR_DATA_RX_Msk                              ((uint32_t)0xFFFFFFFF)

/** @} */ /* End of group MCBSP_DRR */

/** @defgroup Periph_MCBSP_DXR MCBSP DXR
  * @{
  */

/*-- MCBSP_DXR:MCBSP DXR Register -----*/

/* Bit field positions: */
#define MCBSP_DXR_DATA_TX_Pos                              0

/* Bit field masks: */
#define MCBSP_DXR_DATA_TX_Msk                              ((uint32_t)0xFFFFFFFF)

/** @} */ /* End of group MCBSP_DXR */

/** @defgroup Periph_MCBSP_SPSA MCBSP SPSA
  * @{
  */

