ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR32FxQI/DeviceSupport/MDR32FG16S1QI/inc/MDR32FG16S1QI.h
/*-- MCBSP_SPSA:MCBSP SPSA Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group MCBSP_SPSA */

/** @defgroup Periph_MCBSP_SPCR MCBSP SPCR
  * @{
  */

/*-- MCBSP_SPCR:MCBSP SPCR Register -----*/

/* Bit field positions: */
#define MCBSP_SPCR_NCGRST_Pos                              0
#define MCBSP_SPCR_NFGRST_Pos                              1
#define MCBSP_SPCR_NRRST_Pos                               2
#define MCBSP_SPCR_NXRST_Pos                               3
#define MCBSP_SPCR_CLKSTP_Pos                              4
#define MCBSP_SPCR_ABIS_Pos                                6
#define MCBSP_SPCR_DLB_Pos                                 7
#define MCBSP_SPCR_RJUST_Pos                               8
#define MCBSP_SPCR_XJUST_Pos                               10
#define MCBSP_SPCR_JBOUND_Pos                              12
#define MCBSP_SPCR_LW_ACC_Pos                              14
#define MCBSP_SPCR_DXENA_Pos                               15
#define MCBSP_SPCR_REVNT0_Pos                              16
#define MCBSP_SPCR_REVNT1_Pos                              18
#define MCBSP_SPCR_RINTM_Pos                               20
#define MCBSP_SPCR_SOFT_Pos                                23
#define MCBSP_SPCR_XEVENT0_Pos                             24
#define MCBSP_SPCR_XEVNT1_Pos                              26
#define MCBSP_SPCR_XEVENT1_Pos                             27
#define MCBSP_SPCR_XINTM_Pos                               28
#define MCBSP_SPCR_FREE_Pos                                31

/* Bit field masks: */
#define MCBSP_SPCR_NCGRST                                  ((uint32_t)0x00000001)
#define MCBSP_SPCR_NFGRST                                  ((uint32_t)0x00000002)
#define MCBSP_SPCR_NRRST                                   ((uint32_t)0x00000004)
#define MCBSP_SPCR_NXRST                                   ((uint32_t)0x00000008)
#define MCBSP_SPCR_CLKSTP_Msk                              ((uint32_t)0x00000030)
#define MCBSP_SPCR_ABIS                                    ((uint32_t)0x00000040)
#define MCBSP_SPCR_DLB                                     ((uint32_t)0x00000080)
#define MCBSP_SPCR_RJUST_Msk                               ((uint32_t)0x00000300)
#define MCBSP_SPCR_XJUST_Msk                               ((uint32_t)0x00000C00)
#define MCBSP_SPCR_JBOUND_Msk                              ((uint32_t)0x00003000)
#define MCBSP_SPCR_LW_ACC                                  ((uint32_t)0x00004000)
#define MCBSP_SPCR_DXENA                                   ((uint32_t)0x00008000)
#define MCBSP_SPCR_REVNT0_Msk                              ((uint32_t)0x00030000)
#define MCBSP_SPCR_REVNT1_Msk                              ((uint32_t)0x000C0000)
#define MCBSP_SPCR_RINTM_Msk                               ((uint32_t)0x00700000)
#define MCBSP_SPCR_SOFT                                    ((uint32_t)0x00800000)
#define MCBSP_SPCR_XEVENT0_Msk                             ((uint32_t)0x03000000)
#define MCBSP_SPCR_XEVNT1                                  ((uint32_t)0x04000000)
#define MCBSP_SPCR_XEVENT1                                 ((uint32_t)0x08000000)
#define MCBSP_SPCR_XINTM_Msk                               ((uint32_t)0x70000000)
#define MCBSP_SPCR_FREE                                    ((uint32_t)0x80000000)

/** @} */ /* End of group MCBSP_SPCR */

/** @defgroup Periph_MCBSP_RCR MCBSP RCR
  * @{
  */

/*-- MCBSP_RCR:MCBSP RCR Register -----*/

/* Bit field positions: */
#define MCBSP_RCR_WLEN_P0_Pos                              0
#define MCBSP_RCR_DELAY_Pos                                5
#define MCBSP_RCR_MSB1ST_Pos                               7
#define MCBSP_RCR_FLEN_P0_Pos                              8
#define MCBSP_RCR_FIG_Pos                                  15
#define MCBSP_RCR_WLEN_P1_Pos                              16
#define MCBSP_RCR_CODEC_Pos                                21
#define MCBSP_RCR_FLEN_P1_Pos                              24
#define MCBSP_RCR_MPHASE_Pos                               31

/* Bit field masks: */
#define MCBSP_RCR_WLEN_P0_Msk                              ((uint32_t)0x0000001F)
#define MCBSP_RCR_DELAY_Msk                                ((uint32_t)0x00000060)
#define MCBSP_RCR_MSB1ST                                   ((uint32_t)0x00000080)
#define MCBSP_RCR_FLEN_P0_Msk                              ((uint32_t)0x00007F00)
#define MCBSP_RCR_FIG                                      ((uint32_t)0x00008000)
#define MCBSP_RCR_WLEN_P1_Msk                              ((uint32_t)0x001F0000)
#define MCBSP_RCR_CODEC_Msk                                ((uint32_t)0x00E00000)
#define MCBSP_RCR_FLEN_P1_Msk                              ((uint32_t)0x7F000000)
#define MCBSP_RCR_MPHASE                                   ((uint32_t)0x80000000)

/** @} */ /* End of group MCBSP_RCR */

/** @defgroup Periph_MCBSP_XCR MCBSP XCR
  * @{
  */

/*-- MCBSP_XCR:MCBSP XCR Register -----*/

/* Bit field positions: */
#define MCBSP_XCR_WLEN_P0_Pos                              0
#define MCBSP_XCR_DELAY_Pos                                5
#define MCBSP_XCR_MSB1ST_Pos                               7
#define MCBSP_XCR_FLEN_P0_Pos                              8
#define MCBSP_XCR_FIG_Pos                                  15
#define MCBSP_XCR_WLEN_P1_Pos                              16
#define MCBSP_XCR_CODEC_Pos                                21
#define MCBSP_XCR_FLEN_P1_Pos                              24
#define MCBSP_XCR_MPHASE_Pos                               31

/* Bit field masks: */
#define MCBSP_XCR_WLEN_P0_Msk                              ((uint32_t)0x0000001F)
#define MCBSP_XCR_DELAY_Msk                                ((uint32_t)0x00000060)
#define MCBSP_XCR_MSB1ST                                   ((uint32_t)0x00000080)
#define MCBSP_XCR_FLEN_P0_Msk                              ((uint32_t)0x00007F00)
#define MCBSP_XCR_FIG                                      ((uint32_t)0x00008000)
#define MCBSP_XCR_WLEN_P1_Msk                              ((uint32_t)0x001F0000)
#define MCBSP_XCR_CODEC_Msk                                ((uint32_t)0x00E00000)
#define MCBSP_XCR_FLEN_P1_Msk                              ((uint32_t)0x7F000000)
#define MCBSP_XCR_MPHASE                                   ((uint32_t)0x80000000)

/** @} */ /* End of group MCBSP_XCR */

/** @defgroup Periph_MCBSP_SRGR MCBSP SRGR
  * @{
  */

/*-- MCBSP_SRGR:MCBSP SRGR Register -----*/

/* Bit field positions: */
#define MCBSP_SRGR_CLKGDV_Pos                              0
#define MCBSP_SRGR_FWID_Pos                                8
#define MCBSP_SRGR_FPER_Pos                                16
#define MCBSP_SRGR_CLKSP_Pos                               28
#define MCBSP_SRGR_CLKSM_Pos                               29
#define MCBSP_SRGR_FSGM_Pos                                30
#define MCBSP_SRGR_GSYNC_Pos                               31

/* Bit field masks: */
#define MCBSP_SRGR_CLKGDV_Msk                              ((uint32_t)0x000000FF)
#define MCBSP_SRGR_FWID_Msk                                ((uint32_t)0x0000FF00)
#define MCBSP_SRGR_FPER_Msk                                ((uint32_t)0x0FFF0000)
#define MCBSP_SRGR_CLKSP                                   ((uint32_t)0x10000000)
#define MCBSP_SRGR_CLKSM                                   ((uint32_t)0x20000000)
#define MCBSP_SRGR_FSGM                                    ((uint32_t)0x40000000)
#define MCBSP_SRGR_GSYNC                                   ((uint32_t)0x80000000)

/** @} */ /* End of group MCBSP_SRGR */

/** @defgroup Periph_MCBSP_MCR MCBSP MCR
  * @{
  */

/*-- MCBSP_MCR:MCBSP MCR Register -----*/

/* Bit field positions: */
#define MCBSP_MCR_MCM_Pos                                  0
#define MCBSP_MCR_CUR_BLK_Pos                              5
#define MCBSP_MCR_BLK0_EN_Pos                              8
#define MCBSP_MCR_BLK1_EN_Pos                              9
#define MCBSP_MCR_BLK2_EN_Pos                              10
#define MCBSP_MCR_BLK3_EN_Pos                              11
#define MCBSP_MCR_BLK4_EN_Pos                              12
#define MCBSP_MCR_BLK5_EN_Pos                              13
#define MCBSP_MCR_BLK6_EN_Pos                              14
#define MCBSP_MCR_BLK7_EN_Pos                              15

/* Bit field masks: */
#define MCBSP_MCR_MCM_Msk                                  ((uint32_t)0x00000003)
#define MCBSP_MCR_CUR_BLK_Msk                              ((uint32_t)0x000000E0)
#define MCBSP_MCR_BLK0_EN                                  ((uint32_t)0x00000100)
#define MCBSP_MCR_BLK1_EN                                  ((uint32_t)0x00000200)
#define MCBSP_MCR_BLK2_EN                                  ((uint32_t)0x00000400)
#define MCBSP_MCR_BLK3_EN                                  ((uint32_t)0x00000800)
#define MCBSP_MCR_BLK4_EN                                  ((uint32_t)0x00001000)
#define MCBSP_MCR_BLK5_EN                                  ((uint32_t)0x00002000)
#define MCBSP_MCR_BLK6_EN                                  ((uint32_t)0x00004000)
#define MCBSP_MCR_BLK7_EN                                  ((uint32_t)0x00008000)

/** @} */ /* End of group MCBSP_MCR */

