ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR32FxQI/DeviceSupport/MDR32FG16S1QI/inc/MDR32FG16S1QI.h
/** @defgroup Periph_MCBSP_XCER MCBSP XCER
  * @{
  */

/*-- MCBSP_XCER:MCBSP XCER Register -----*/

/* Bit field positions: */
#define MCBSP_XCER_CH0_EN_Pos                              0
#define MCBSP_XCER_CH1_EN_Pos                              1
#define MCBSP_XCER_CH2_EN_Pos                              2
#define MCBSP_XCER_CH3_EN_Pos                              3
#define MCBSP_XCER_CH4_EN_Pos                              4
#define MCBSP_XCER_CH5_EN_Pos                              5
#define MCBSP_XCER_CH6_EN_Pos                              6
#define MCBSP_XCER_CH7_EN_Pos                              7
#define MCBSP_XCER_CH8_EN_Pos                              8
#define MCBSP_XCER_CH9_EN_Pos                              9
#define MCBSP_XCER_CH10_EN_Pos                             10
#define MCBSP_XCER_CH11_EN_Pos                             11
#define MCBSP_XCER_CH12_EN_Pos                             12
#define MCBSP_XCER_CH13_EN_Pos                             13
#define MCBSP_XCER_CH14_EN_Pos                             14
#define MCBSP_XCER_CH15_EN_Pos                             15
#define MCBSP_XCER_CH16_EN_Pos                             16
#define MCBSP_XCER_CH17_EN_Pos                             17
#define MCBSP_XCER_CH18_EN_Pos                             18
#define MCBSP_XCER_CH19_EN_Pos                             19
#define MCBSP_XCER_CH20_EN_Pos                             20
#define MCBSP_XCER_CH21_EN_Pos                             21
#define MCBSP_XCER_CH22_EN_Pos                             22
#define MCBSP_XCER_CH23_EN_Pos                             23
#define MCBSP_XCER_CH24_EN_Pos                             24
#define MCBSP_XCER_CH25_EN_Pos                             25
#define MCBSP_XCER_CH26_EN_Pos                             26
#define MCBSP_XCER_CH27_EN_Pos                             27
#define MCBSP_XCER_CH28_EN_Pos                             28
#define MCBSP_XCER_CH29_EN_Pos                             29
#define MCBSP_XCER_CH30_EN_Pos                             30
#define MCBSP_XCER_CH31_EN_Pos                             31

/* Bit field masks: */
#define MCBSP_XCER_CH0_EN                                  ((uint32_t)0x00000001)
#define MCBSP_XCER_CH1_EN                                  ((uint32_t)0x00000002)
#define MCBSP_XCER_CH2_EN                                  ((uint32_t)0x00000004)
#define MCBSP_XCER_CH3_EN                                  ((uint32_t)0x00000008)
#define MCBSP_XCER_CH4_EN                                  ((uint32_t)0x00000010)
#define MCBSP_XCER_CH5_EN                                  ((uint32_t)0x00000020)
#define MCBSP_XCER_CH6_EN                                  ((uint32_t)0x00000040)
#define MCBSP_XCER_CH7_EN                                  ((uint32_t)0x00000080)
#define MCBSP_XCER_CH8_EN                                  ((uint32_t)0x00000100)
#define MCBSP_XCER_CH9_EN                                  ((uint32_t)0x00000200)
#define MCBSP_XCER_CH10_EN                                 ((uint32_t)0x00000400)
#define MCBSP_XCER_CH11_EN                                 ((uint32_t)0x00000800)
#define MCBSP_XCER_CH12_EN                                 ((uint32_t)0x00001000)
#define MCBSP_XCER_CH13_EN                                 ((uint32_t)0x00002000)
#define MCBSP_XCER_CH14_EN                                 ((uint32_t)0x00004000)
#define MCBSP_XCER_CH15_EN                                 ((uint32_t)0x00008000)
#define MCBSP_XCER_CH16_EN                                 ((uint32_t)0x00010000)
#define MCBSP_XCER_CH17_EN                                 ((uint32_t)0x00020000)
#define MCBSP_XCER_CH18_EN                                 ((uint32_t)0x00040000)
#define MCBSP_XCER_CH19_EN                                 ((uint32_t)0x00080000)
#define MCBSP_XCER_CH20_EN                                 ((uint32_t)0x00100000)
#define MCBSP_XCER_CH21_EN                                 ((uint32_t)0x00200000)
#define MCBSP_XCER_CH22_EN                                 ((uint32_t)0x00400000)
#define MCBSP_XCER_CH23_EN                                 ((uint32_t)0x00800000)
#define MCBSP_XCER_CH24_EN                                 ((uint32_t)0x01000000)
#define MCBSP_XCER_CH25_EN                                 ((uint32_t)0x02000000)
#define MCBSP_XCER_CH26_EN                                 ((uint32_t)0x04000000)
#define MCBSP_XCER_CH27_EN                                 ((uint32_t)0x08000000)
#define MCBSP_XCER_CH28_EN                                 ((uint32_t)0x10000000)
#define MCBSP_XCER_CH29_EN                                 ((uint32_t)0x20000000)
#define MCBSP_XCER_CH30_EN                                 ((uint32_t)0x40000000)
#define MCBSP_XCER_CH31_EN                                 ((uint32_t)0x80000000)

/** @} */ /* End of group MCBSP_XCER */

/** @defgroup Periph_MCBSP_RCER MCBSP RCER
  * @{
  */

/*-- MCBSP_RCER:MCBSP RCER Register -----*/

/* Bit field positions: */
#define MCBSP_RCER_CH0_EN_Pos                              0
#define MCBSP_RCER_CH1_EN_Pos                              1
#define MCBSP_RCER_CH2_EN_Pos                              2
#define MCBSP_RCER_CH3_EN_Pos                              3
#define MCBSP_RCER_CH4_EN_Pos                              4
#define MCBSP_RCER_CH5_EN_Pos                              5
#define MCBSP_RCER_CH6_EN_Pos                              6
#define MCBSP_RCER_CH7_EN_Pos                              7
#define MCBSP_RCER_CH8_EN_Pos                              8
#define MCBSP_RCER_CH9_EN_Pos                              9
#define MCBSP_RCER_CH10_EN_Pos                             10
#define MCBSP_RCER_CH11_EN_Pos                             11
#define MCBSP_RCER_CH12_EN_Pos                             12
#define MCBSP_RCER_CH13_EN_Pos                             13
#define MCBSP_RCER_CH14_EN_Pos                             14
#define MCBSP_RCER_CH15_EN_Pos                             15
#define MCBSP_RCER_CH16_EN_Pos                             16
#define MCBSP_RCER_CH17_EN_Pos                             17
#define MCBSP_RCER_CH18_EN_Pos                             18
#define MCBSP_RCER_CH19_EN_Pos                             19
#define MCBSP_RCER_CH20_EN_Pos                             20
#define MCBSP_RCER_CH21_EN_Pos                             21
#define MCBSP_RCER_CH22_EN_Pos                             22
#define MCBSP_RCER_CH23_EN_Pos                             23
#define MCBSP_RCER_CH24_EN_Pos                             24
#define MCBSP_RCER_CH25_EN_Pos                             25
#define MCBSP_RCER_CH26_EN_Pos                             26
#define MCBSP_RCER_CH27_EN_Pos                             27
#define MCBSP_RCER_CH28_EN_Pos                             28
#define MCBSP_RCER_CH29_EN_Pos                             29
#define MCBSP_RCER_CH30_EN_Pos                             30
#define MCBSP_RCER_CH31_EN_Pos                             31

/* Bit field masks: */
#define MCBSP_RCER_CH0_EN                                  ((uint32_t)0x00000001)
#define MCBSP_RCER_CH1_EN                                  ((uint32_t)0x00000002)
#define MCBSP_RCER_CH2_EN                                  ((uint32_t)0x00000004)
#define MCBSP_RCER_CH3_EN                                  ((uint32_t)0x00000008)
#define MCBSP_RCER_CH4_EN                                  ((uint32_t)0x00000010)
#define MCBSP_RCER_CH5_EN                                  ((uint32_t)0x00000020)
#define MCBSP_RCER_CH6_EN                                  ((uint32_t)0x00000040)
#define MCBSP_RCER_CH7_EN                                  ((uint32_t)0x00000080)
#define MCBSP_RCER_CH8_EN                                  ((uint32_t)0x00000100)
#define MCBSP_RCER_CH9_EN                                  ((uint32_t)0x00000200)
#define MCBSP_RCER_CH10_EN                                 ((uint32_t)0x00000400)
#define MCBSP_RCER_CH11_EN                                 ((uint32_t)0x00000800)
#define MCBSP_RCER_CH12_EN                                 ((uint32_t)0x00001000)
#define MCBSP_RCER_CH13_EN                                 ((uint32_t)0x00002000)
#define MCBSP_RCER_CH14_EN                                 ((uint32_t)0x00004000)
#define MCBSP_RCER_CH15_EN                                 ((uint32_t)0x00008000)
#define MCBSP_RCER_CH16_EN                                 ((uint32_t)0x00010000)
#define MCBSP_RCER_CH17_EN                                 ((uint32_t)0x00020000)
#define MCBSP_RCER_CH18_EN                                 ((uint32_t)0x00040000)
#define MCBSP_RCER_CH19_EN                                 ((uint32_t)0x00080000)
#define MCBSP_RCER_CH20_EN                                 ((uint32_t)0x00100000)
#define MCBSP_RCER_CH21_EN                                 ((uint32_t)0x00200000)
#define MCBSP_RCER_CH22_EN                                 ((uint32_t)0x00400000)
#define MCBSP_RCER_CH23_EN                                 ((uint32_t)0x00800000)
#define MCBSP_RCER_CH24_EN                                 ((uint32_t)0x01000000)
#define MCBSP_RCER_CH25_EN                                 ((uint32_t)0x02000000)
#define MCBSP_RCER_CH26_EN                                 ((uint32_t)0x04000000)
#define MCBSP_RCER_CH27_EN                                 ((uint32_t)0x08000000)
#define MCBSP_RCER_CH28_EN                                 ((uint32_t)0x10000000)
#define MCBSP_RCER_CH29_EN                                 ((uint32_t)0x20000000)
#define MCBSP_RCER_CH30_EN                                 ((uint32_t)0x40000000)
#define MCBSP_RCER_CH31_EN                                 ((uint32_t)0x80000000)

/** @} */ /* End of group MCBSP_RCER */

/** @defgroup Periph_MCBSP_PCR_SPSR MCBSP PCR_SPSR
  * @{
  */

/*-- MCBSP_PCR_SPSR:MCBSP PCR_SPSR Register -----*/

/* Bit field positions: */
#define MCBSP_PCR_SPSR_CLKRP_Pos                           0
#define MCBSP_PCR_SPSR_CLKXP_Pos                           1
#define MCBSP_PCR_SPSR_FSRP_Pos                            2
#define MCBSP_PCR_SPSR_FSXP_Pos                            3
#define MCBSP_PCR_SPSR_DR_ST_Pos                           4
#define MCBSP_PCR_SPSR_DX_ST_Pos                           5
#define MCBSP_PCR_SPSR_CLKS_ST_Pos                         6
#define MCBSP_PCR_SPSR_CLKRM_Pos                           8
#define MCBSP_PCR_SPSR_CLKXM_Pos                           9
#define MCBSP_PCR_SPSR_FSRM_Pos                            10
#define MCBSP_PCR_SPSR_FSXM_Pos                            11
#define MCBSP_PCR_SPSR_RIOEN_Pos                           12
#define MCBSP_PCR_SPSR_XIOEN_Pos                           13
#define MCBSP_PCR_SPSR_RRDY_Pos                            16
#define MCBSP_PCR_SPSR_FFULL_Pos                           17
#define MCBSP_PCR_SPSR_RSER_Pos                            18
#define MCBSP_PCR_SPSR_RLOST_Pos                           19
#define MCBSP_PCR_SPSR_RFIFO_E_Pos                         20
#define MCBSP_PCR_SPSR_RFIFO_H_Pos                         21
#define MCBSP_PCR_SPSR_RFIFO_F_Pos                         22
#define MCBSP_PCR_SPSR_XRDY_Pos                            24
#define MCBSP_PCR_SPSR_XEMPTY_Pos                          25
#define MCBSP_PCR_SPSR_XSERR_Pos                           26
#define MCBSP_PCR_SPSR_XLOST_Pos                           27
#define MCBSP_PCR_SPSR_XFIFO_E_Pos                         28
#define MCBSP_PCR_SPSR_ZFIFO_H_Pos                         29
#define MCBSP_PCR_SPSR_XFIFO_F_Pos                         30

/* Bit field masks: */
#define MCBSP_PCR_SPSR_CLKRP                               ((uint32_t)0x00000001)
#define MCBSP_PCR_SPSR_CLKXP                               ((uint32_t)0x00000002)
#define MCBSP_PCR_SPSR_FSRP                                ((uint32_t)0x00000004)
#define MCBSP_PCR_SPSR_FSXP                                ((uint32_t)0x00000008)
#define MCBSP_PCR_SPSR_DR_ST                               ((uint32_t)0x00000010)
#define MCBSP_PCR_SPSR_DX_ST                               ((uint32_t)0x00000020)
#define MCBSP_PCR_SPSR_CLKS_ST                             ((uint32_t)0x00000040)
#define MCBSP_PCR_SPSR_CLKRM                               ((uint32_t)0x00000100)
#define MCBSP_PCR_SPSR_CLKXM                               ((uint32_t)0x00000200)
#define MCBSP_PCR_SPSR_FSRM                                ((uint32_t)0x00000400)
#define MCBSP_PCR_SPSR_FSXM                                ((uint32_t)0x00000800)
#define MCBSP_PCR_SPSR_RIOEN                               ((uint32_t)0x00001000)
#define MCBSP_PCR_SPSR_XIOEN                               ((uint32_t)0x00002000)
#define MCBSP_PCR_SPSR_RRDY                                ((uint32_t)0x00010000)
#define MCBSP_PCR_SPSR_FFULL                               ((uint32_t)0x00020000)
#define MCBSP_PCR_SPSR_RSER                                ((uint32_t)0x00040000)
#define MCBSP_PCR_SPSR_RLOST                               ((uint32_t)0x00080000)
#define MCBSP_PCR_SPSR_RFIFO_E                             ((uint32_t)0x00100000)
#define MCBSP_PCR_SPSR_RFIFO_H                             ((uint32_t)0x00200000)
#define MCBSP_PCR_SPSR_RFIFO_F                             ((uint32_t)0x00400000)
#define MCBSP_PCR_SPSR_XRDY                                ((uint32_t)0x01000000)
#define MCBSP_PCR_SPSR_XEMPTY                              ((uint32_t)0x02000000)
#define MCBSP_PCR_SPSR_XSERR                               ((uint32_t)0x04000000)
#define MCBSP_PCR_SPSR_XLOST                               ((uint32_t)0x08000000)
#define MCBSP_PCR_SPSR_XFIFO_E                             ((uint32_t)0x10000000)
#define MCBSP_PCR_SPSR_ZFIFO_H                             ((uint32_t)0x20000000)
#define MCBSP_PCR_SPSR_XFIFO_F                             ((uint32_t)0x40000000)

/** @} */ /* End of group MCBSP_PCR_SPSR */

/** @} */ /* End of group MCBSP */

/** @defgroup MDR32FG16S1QI_Periph_DSP_TIMER DSP_TIMER
  * @{
  */


/* MDR_DSP_TIMER_TypeDef structure */
typedef struct {
	__IO uint32_t	PDR_TIM;                /*!< */
	__IO uint32_t	TCR;                    /*!< */
}MDR_DSP_TIMER_TypeDef;

/** @defgroup Periph_DSP_TIMER_PDR_TIM DSP_TIMER PDR_TIM
  * @{
  */

/*-- DSP_TIMER_PDR_TIM:DSP_TIMER PDR_TIM Register -----*/

/* Bit field positions: */
#define DSP_TIMER_PDR_TIM_CNT_Pos                          0
#define DSP_TIMER_PDR_TIM_PR_Pos                           16

/* Bit field masks: */
#define DSP_TIMER_PDR_TIM_CNT_Msk                          ((uint32_t)0x0000FFFF)
#define DSP_TIMER_PDR_TIM_PR_Msk                           ((uint32_t)0xFFFF0000)

