ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR32FxQI/DeviceSupport/MDR32FG16S1QI/inc/MDR32FG16S1QI.h
/** @} */ /* End of group DSP_TIMER_PDR_TIM */

/** @defgroup Periph_DSP_TIMER_TCR DSP_TIMER TCR
  * @{
  */

/*-- DSP_TIMER_TCR:DSP_TIMER TCR Register -----*/

/* Bit field positions: */
#define DSP_TIMER_TCR_TDDR_Pos                             0
#define DSP_TIMER_TCR_TSS_Pos                              4
#define DSP_TIMER_TCR_TRB_Pos                              5
#define DSP_TIMER_TCR_PSC_Pos                              6
#define DSP_TIMER_TCR_FREE_Pos                             8
#define DSP_TIMER_TCR_SOFT_Pos                             9

/* Bit field masks: */
#define DSP_TIMER_TCR_TDDR_Msk                             ((uint32_t)0x0000000F)
#define DSP_TIMER_TCR_TSS                                  ((uint32_t)0x00000010)
#define DSP_TIMER_TCR_TRB                                  ((uint32_t)0x00000020)
#define DSP_TIMER_TCR_PSC_Msk                              ((uint32_t)0x000000C0)
#define DSP_TIMER_TCR_FREE                                 ((uint32_t)0x00000100)
#define DSP_TIMER_TCR_SOFT                                 ((uint32_t)0x00000200)

/** @} */ /* End of group DSP_TIMER_TCR */

/** @} */ /* End of group DSP_TIMER */

/** @defgroup MDR32FG16S1QI_Periph_DSP_DMA DSP_DMA
  * @{
  */


/* MDR_DSP_DMA_TypeDef structure */
typedef struct {
	__IO uint32_t	DMA_STATUS;             /*!< */
	__IO uint32_t	DMA_CONFIG;             /*!< */
	__IO uint32_t	CTRL_BASE_PTR;          /*!< */
	__IO uint32_t	ALT_CTRL_BASE_PTR;      /*!< */
	__IO uint32_t	DMA_WAITONREG_STATUS;   /*!< */
	__IO uint32_t	CHNL_SW_REQUEST;        /*!< */
	__IO uint32_t	CHNL_USEBURST_SET;      /*!< */
	__IO uint32_t	CHNL_USEBURST_CLR;      /*!< */
	__IO uint32_t	CHNL_REQ_MASK_SET;      /*!< */
	__IO uint32_t	CHNL_REQ_MASK_CLR;      /*!< */
	__IO uint32_t	CHNL_ENABLE_SET;        /*!< */
	__IO uint32_t	CHNL_ENABLE_CLR;        /*!< */
	__IO uint32_t	CHNL_PRI_ALT_SET;       /*!< */
	__IO uint32_t	CHNL_PRI_ALT_CLR;       /*!< */
	__IO uint32_t	CHNL_PRIORITY_SET;      /*!< */
	__IO uint32_t	CHNL_PRIORITY_CLR;      /*!< */
	__IO uint32_t	ERR_CLR;                /*!< */
}MDR_DSP_DMA_TypeDef;

/** @defgroup Periph_DSP_DMA_DMA_STATUS DSP_DMA DMA_STATUS
  * @{
  */

/*-- DSP_DMA_DMA_STATUS:DSP_DMA DMA_STATUS Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_DMA_STATUS */

/** @defgroup Periph_DSP_DMA_DMA_CONFIG DSP_DMA DMA_CONFIG
  * @{
  */

/*-- DSP_DMA_DMA_CONFIG:DSP_DMA DMA_CONFIG Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_DMA_CONFIG */

/** @defgroup Periph_DSP_DMA_CTRL_BASE_PTR DSP_DMA CTRL_BASE_PTR
  * @{
  */

/*-- DSP_DMA_CTRL_BASE_PTR:DSP_DMA CTRL_BASE_PTR Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_CTRL_BASE_PTR */

/** @defgroup Periph_DSP_DMA_ALT_CTRL_BASE_PTR DSP_DMA ALT_CTRL_BASE_PTR
  * @{
  */

/*-- DSP_DMA_ALT_CTRL_BASE_PTR:DSP_DMA ALT_CTRL_BASE_PTR Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_ALT_CTRL_BASE_PTR */

/** @defgroup Periph_DSP_DMA_DMA_WAITONREG_STATUS DSP_DMA DMA_WAITONREG_STATUS
  * @{
  */

/*-- DSP_DMA_DMA_WAITONREG_STATUS:DSP_DMA DMA_WAITONREG_STATUS Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_DMA_WAITONREG_STATUS */

/** @defgroup Periph_DSP_DMA_CHNL_SW_REQUEST DSP_DMA CHNL_SW_REQUEST
  * @{
  */

/*-- DSP_DMA_CHNL_SW_REQUEST:DSP_DMA CHNL_SW_REQUEST Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_CHNL_SW_REQUEST */

/** @defgroup Periph_DSP_DMA_CHNL_USEBURST_SET DSP_DMA CHNL_USEBURST_SET
  * @{
  */

/*-- DSP_DMA_CHNL_USEBURST_SET:DSP_DMA CHNL_USEBURST_SET Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_CHNL_USEBURST_SET */

/** @defgroup Periph_DSP_DMA_CHNL_USEBURST_CLR DSP_DMA CHNL_USEBURST_CLR
  * @{
  */

/*-- DSP_DMA_CHNL_USEBURST_CLR:DSP_DMA CHNL_USEBURST_CLR Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_CHNL_USEBURST_CLR */

/** @defgroup Periph_DSP_DMA_CHNL_REQ_MASK_SET DSP_DMA CHNL_REQ_MASK_SET
  * @{
  */

/*-- DSP_DMA_CHNL_REQ_MASK_SET:DSP_DMA CHNL_REQ_MASK_SET Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_CHNL_REQ_MASK_SET */

/** @defgroup Periph_DSP_DMA_CHNL_REQ_MASK_CLR DSP_DMA CHNL_REQ_MASK_CLR
  * @{
  */

/*-- DSP_DMA_CHNL_REQ_MASK_CLR:DSP_DMA CHNL_REQ_MASK_CLR Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_CHNL_REQ_MASK_CLR */

/** @defgroup Periph_DSP_DMA_CHNL_ENABLE_SET DSP_DMA CHNL_ENABLE_SET
  * @{
  */

/*-- DSP_DMA_CHNL_ENABLE_SET:DSP_DMA CHNL_ENABLE_SET Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_CHNL_ENABLE_SET */

/** @defgroup Periph_DSP_DMA_CHNL_ENABLE_CLR DSP_DMA CHNL_ENABLE_CLR
  * @{
  */

/*-- DSP_DMA_CHNL_ENABLE_CLR:DSP_DMA CHNL_ENABLE_CLR Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_CHNL_ENABLE_CLR */

/** @defgroup Periph_DSP_DMA_CHNL_PRI_ALT_SET DSP_DMA CHNL_PRI_ALT_SET
  * @{
  */

/*-- DSP_DMA_CHNL_PRI_ALT_SET:DSP_DMA CHNL_PRI_ALT_SET Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_CHNL_PRI_ALT_SET */

/** @defgroup Periph_DSP_DMA_CHNL_PRI_ALT_CLR DSP_DMA CHNL_PRI_ALT_CLR
  * @{
  */

/*-- DSP_DMA_CHNL_PRI_ALT_CLR:DSP_DMA CHNL_PRI_ALT_CLR Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_CHNL_PRI_ALT_CLR */

/** @defgroup Periph_DSP_DMA_CHNL_PRIORITY_SET DSP_DMA CHNL_PRIORITY_SET
  * @{
  */

/*-- DSP_DMA_CHNL_PRIORITY_SET:DSP_DMA CHNL_PRIORITY_SET Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_CHNL_PRIORITY_SET */

/** @defgroup Periph_DSP_DMA_CHNL_PRIORITY_CLR DSP_DMA CHNL_PRIORITY_CLR
  * @{
  */

/*-- DSP_DMA_CHNL_PRIORITY_CLR:DSP_DMA CHNL_PRIORITY_CLR Register -----*/

/* Bit field positions: */

/* Bit field masks: */

/** @} */ /* End of group DSP_DMA_CHNL_PRIORITY_CLR */

/** @defgroup Periph_DSP_DMA_ERR_CLR DSP_DMA ERR_CLR
  * @{
  */

/*-- DSP_DMA_ERR_CLR:DSP_DMA ERR_CLR Register -----*/

/* Bit field positions: */
#define DSP_DMA_ERR_CLR_CHNL_PRIORITY_SET_Pos              0

/* Bit field masks: */
#define DSP_DMA_ERR_CLR_CHNL_PRIORITY_SET                  ((uint32_t)0x00000001)

/** @} */ /* End of group DSP_DMA_ERR_CLR */

/** @} */ /* End of group DSP_DMA */

/** @defgroup MDR32FG16S1QI_Periph_DSP_CRPT DSP_CRPT
  * @{
  */
/* MDR_DSP_CRPT_TypeDef structure */
typedef struct {
	__IO uint32_t	CWR;                    /*!< */
	__IO uint32_t	SR;                     /*!< */
	__IO uint32_t	DATA;                   /*!< */
	__IO uint32_t	KR;                     /*!< */
	__IO uint32_t	CR;                   	/*!< */
	__IO uint32_t	SYNR;                    /*!< */
	__IO uint32_t	IMIT;                   /*!< */
	__IO uint32_t	ITER;                   /*!< */
}MDR_DSP_CRPT_TypeDef;

/** @defgroup Periph_DSP_CRPT_CWR DSP_CRPT CWR
  * @{
  */

/*-- DSP_CRPT_CWR:DSP_CRPT CWR Register -----*/

/* Bit field positions: */
#define DSP_CRPT_CWR_MODE_Pos                              0
#define DSP_CRPT_CWR_IM_Pos                                2
#define DSP_CRPT_CWR_START_Pos                             3
#define DSP_CRPT_CWR_DIR_Pos                               4
#define DSP_CRPT_CWR_IE_CRPT_Pos                           5
#define DSP_CRPT_CWR_RST_Pos                               6
#define DSP_CRPT_CWR_BIST_Pos                              7

/* Bit field masks: */
#define DSP_CRPT_CWR_MODE_Msk                              ((uint32_t)0x00000003)
#define DSP_CRPT_CWR_IM                                    ((uint32_t)0x00000004)
#define DSP_CRPT_CWR_START                                 ((uint32_t)0x00000008)
#define DSP_CRPT_CWR_DIR                                   ((uint32_t)0x00000010)
#define DSP_CRPT_CWR_IE_CRPT                               ((uint32_t)0x00000020)
#define DSP_CRPT_CWR_RST                                   ((uint32_t)0x00000040)
#define DSP_CRPT_CWR_BIST                                  ((uint32_t)0x00000080)

/** @} */ /* End of group Periph_DSP_CRPT_CWR */

/** @defgroup Periph_DSP_CRPT_SR DSP_CRPT SR
  * @{
  */

/*-- DSP_CRPT_SR:DSP_CRPT SR Register -----*/

/* Bit field positions: */
#define DSP_CRPT_SR_READY_Pos                              0
#define DSP_CRPT_SR_ERROR_Pos                              1
#define DSP_CRPT_SR_KF_Pos                                 2
#define DSP_CRPT_SR_DW_Pos                                 3
#define DSP_CRPT_SR_DR_Pos                                 4
#define DSP_CRPT_SR_SW_Pos                                 5
#define DSP_CRPT_SR_KW_Pos                                 6

/* Bit field masks: */
#define DSP_CRPT_SR_READY                                  ((uint32_t)0x00000001)
#define DSP_CRPT_SR_ERROR                                  ((uint32_t)0x00000002)
#define DSP_CRPT_SR_KF                                     ((uint32_t)0x00000004)
#define DSP_CRPT_SR_DW                                     ((uint32_t)0x00000008)
#define DSP_CRPT_SR_DR                                     ((uint32_t)0x00000010)
#define DSP_CRPT_SR_SW                                     ((uint32_t)0x00000020)
#define DSP_CRPT_SR_KW                                     ((uint32_t)0x00000040)

/** @} */ /* End of group Periph_DSP_CRPT_SR */

/** @defgroup Periph_DSP_CRPT_DATA DSP_CRPT DATA
  * @{
  */

/*-- DSP_CRPT_DATA:DSP_CRPT DATA Register -----*/

/* Bit field positions: */
#define DSP_CRPT_DATA_DATA_Pos                             0

/* Bit field masks: */
#define DSP_CRPT_DATA_DATA_Msk                             ((uint32_t)0x0000FFFF)

/** @} */ /* End of group Periph_DSP_CRPT_DATA */

/** @defgroup Periph_DSP_CRPT_KR DSP_CRPT KR
  * @{
  */

/*-- DSP_CRPT_KR:DSP_CRPT KR Register -----*/

/* Bit field positions: */
#define DSP_CRPT_KR_KEY_Pos                                0

/* Bit field masks: */
#define DSP_CRPT_KR_KEY_Msk                                ((uint32_t)0x0000FFFF)

/** @} */ /* End of group Periph_DSP_CRPT_KR */

/** @defgroup Periph_DSP_CRPT_SYNR DSP_CRPT SYNR
  * @{
  */

/*-- DSP_CRPT_SYNR:DSP_CRPT SYNR Register -----*/

/* Bit field positions: */
#define DSP_CRPT_SYNR_KEY_Pos                              0
#define DSP_CRPT_SYNR_SYNCH_Pos                            1

/* Bit field masks: */
#define DSP_CRPT_SYNR_KEY                                  ((uint32_t)0x00000001)
#define DSP_CRPT_SYNR_SYNCH_Msk                            ((uint32_t)0x0000FFFE)

/** @} */ /* End of group Periph_DSP_CRPT_SYNR */

/** @defgroup Periph_DSP_CRPT_CR DSP_CRPT CR
  * @{
  */

/*-- DSP_CRPT_CR:DSP_CRPT CR Register -----*/

/* Bit field positions: */
#define DSP_CRPT_CR_CONST_Pos                              0

/* Bit field masks: */
#define DSP_CRPT_CR_CONST_Msk                              ((uint32_t)0x0000FFFF)

/** @} */ /* End of group Periph_DSP_CRPT_CR */

/** @defgroup Periph_DSP_CRPT_IMIT DSP_CRPT IMIT
  * @{
  */

/*-- DSP_CRPT_IMIT:DSP_CRPT IMIT Register -----*/

/* Bit field positions: */
#define DSP_CRPT_IMIT_IMIT_Pos                             0

/* Bit field masks: */
#define DSP_CRPT_IMIT_IMIT_Msk                             ((uint32_t)0x0000FFFF)

/** @} */ /* End of group Periph_DSP_CRPT_IMIT */

/** @defgroup Periph_DSP_CRPT_ITER DSP_CRPT ITER
  * @{
  */

/*-- DSP_CRPT_ITER:DSP_CRPT ITER Register -----*/

/* Bit field positions: */
#define DSP_CRPT_ITER_ITER0_Pos                            0
#define DSP_CRPT_ITER_ITER1_Pos                            1
#define DSP_CRPT_ITER_ITER2_Pos                            2
#define DSP_CRPT_ITER_ITER3_Pos                            3
#define DSP_CRPT_ITER_ITER4_Pos                            4
#define DSP_CRPT_ITER_ITER5_Pos                            5
#define DSP_CRPT_ITER_EN_CRPT_Pos                          6

/* Bit field masks: */
#define DSP_CRPT_ITER_ITER0                                ((uint32_t)0x00000001)
#define DSP_CRPT_ITER_ITER1                                ((uint32_t)0x00000002)
#define DSP_CRPT_ITER_ITER2                                ((uint32_t)0x00000004)
#define DSP_CRPT_ITER_ITER3                                ((uint32_t)0x00000008)
#define DSP_CRPT_ITER_ITER4                                ((uint32_t)0x00000010)
#define DSP_CRPT_ITER_ITER5                                ((uint32_t)0x00000020)
#define DSP_CRPT_ITER_EN_CRPT                              ((uint32_t)0x00000040)

